{
    "qa_categories": {
        "institution": {
            "titre": {
                "fr": "Informations sur l'Institution",
                "en": "Institution Information"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quel est le nom complet et le sigle de l'institution ?",
                        "en": "What is the full name and acronym of the institution?"
                    },
                    "reponse": {
                        "fr": {
                            "nom_complet": "Institut Supérieur des Études Technologiques de Sfax",
                            "sigle": "ISET Sfax"
                        },
                        "en": {
                            "full_name": "Higher Institute of Technological Studies of Sfax",
                            "acronym": "ISET Sfax"
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les coordonnées de l'ISET Sfax ?",
                        "en": "What are the contact details of ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "adresse": "Route Mahdia Km 2.5, Sfax 3021, Tunisie",
                            "telephone": "+216 74 240 600",
                            "fax": "+216 74 240 600",
                            "email": "contact@sfax.r-iset.tn",
                            "site_web": "https://isetsf.rnu.tn/fr"
                        },
                        "en": {
                            "address": "Mahdia Road Km 2.5, Sfax 3021, Tunisia",
                            "phone": "+216 74 240 600",
                            "fax": "+216 74 240 600",
                            "email": "contact@sfax.r-iset.tn",
                            "website": "https://isetsf.rnu.tn/fr"
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelle est la présentation et la mission de l'ISET Sfax ?",
                        "en": "What is the presentation and mission of ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "presentation": "L'ISET de Sfax forme de jeunes diplômés experts dotés d'un esprit d'initiative et d'une culture d'entrepreneuriat, capables de s'adapter à toutes les mutations du monde économique. Depuis 1994, l'institut a formé plusieurs milliers d'étudiants qui ont intégré l'univers de l'entreprise en Tunisie et partout dans le monde, dans tous les secteurs d'activité économique.",
                            "mission": "L'ISET de Sfax a pour vocation première de former des profils aux compétences reconnues, en parfaite adéquation avec les besoins des entreprises. Il accomplit cette mission avec excellence grâce à une offre de formation performante, orientée vers la professionnalisation et la pratique, et étroitement liée à ses partenaires socio-économiques de la région."
                        },
                        "en": {
                            "presentation": "ISET Sfax trains expert graduates with initiative and entrepreneurial spirit, capable of adapting to all economic changes. Since 1994, the institute has trained thousands of students who have joined the business world in Tunisia and around the world, in all economic sectors.",
                            "mission": "ISET Sfax's primary mission is to train profiles with recognized skills, perfectly aligned with business needs. It accomplishes this mission with excellence through a high-performance training offer, oriented towards professionalization and practice, and closely linked to its socio-economic partners in the region."
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quels sont les objectifs de l'ISET Sfax ?",
                        "en": "What are the objectives of ISET Sfax?"
                    },
                    "reponse": {
                        "fr": [
                            "Former des techniciens supérieurs compétents et prêts à intégrer le marché du travail",
                            "Encourager l'innovation et la recherche appliquée",
                            "Collaborer avec les entreprises locales et internationales pour offrir des opportunités de stage et d'emploi aux étudiants"
                        ],
                        "en": [
                            "Train competent senior technicians ready to enter the job market",
                            "Encourage innovation and applied research",
                            "Collaborate with local and international companies to provide internship and employment opportunities for students"
                        ]
                    }
                },
                {
                    "question": {
                        "fr": "Quel est le statut juridique de l'ISET Sfax ?",
                        "en": "What is the legal status of ISET Sfax?"
                    },
                    "reponse": {
                        "fr": "L'Institut Supérieur des Etudes Technologiques de Sfax est un établissement public doté de la personnalité civile et de l'autonomie financière. Relevant au ministère de l'Enseignement Supérieur et de la Recherche Scientifique. Sa création est décrétée par la loi n°92-51 du 18 mai 1992.",
                        "en": "The Higher Institute of Technological Studies of Sfax is a public institution with civil personality and financial autonomy. It reports to the Ministry of Higher Education and Scientific Research. Its creation was decreed by law n°92-51 of May 18, 1992."
                    }
                },
                {
                    "question": {
                        "fr": "Qui sont les principaux responsables de l'ISET Sfax ?",
                        "en": "Who are the main officials of ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "directeur": "Bassem JALLOULI",
                            "secretaire_general": "Fathi Ben Abdallah",
                            "directeur_etudes": "Slim BEN HLIMA"
                        },
                        "en": {
                            "director": "Bassem JALLOULI",
                            "general_secretary": "Fathi Ben Abdallah",
                            "director_of_studies": "Slim BEN HLIMA"
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les infrastructures disponibles à l'ISET Sfax ?",
                        "en": "What facilities are available at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "salles_enseignement": 60,
                            "amphitheatres": 3,
                            "laboratoires": 45,
                            "ateliers": 2,
                            "salles_lecture": 2,
                            "bibliotheque": "1 bibliothèque avec 3550 ouvrages",
                            "autres": [
                                "1 parking",
                                "1 buvette",
                                "3 terrains de sport",
                                "1 salle d'exposition",
                                "1 restaurant universitaire"
                            ]
                        },
                        "en": {
                            "teaching_rooms": 60,
                            "amphitheaters": 3,
                            "laboratories": 45,
                            "workshops": 2,
                            "reading_rooms": 2,
                            "library": "1 library with 3550 books",
                            "other": [
                                "1 parking lot",
                                "1 cafeteria",
                                "3 sports fields",
                                "1 exhibition hall",
                                "1 university restaurant"
                            ]
                        }
        
                    }
                },
                {
            "question": {
                "fr": "Quel est le nom de l'ISETSF ?",
                "en": "What is ISETSF?"
            },
            "reponse": {
                "fr": "L'Institut Supérieur des Études Technologiques de Sfax (ISETSF) est une institution tunisienne dédiée aux études technologiques.",
                "en": "The Higher Institute of Technological Studies of Sfax (ISETSF) is a Tunisian higher education institution dedicated to technological studies."
            }
        },
        {
            "question": {
                "fr": "Où se situe l'ISETSF ?",
                "en": "Where is ISETSF located?"
            },
            "reponse": {
                "fr": "L'ISETSF est situé à Sfax, en Tunisie, offrant un environnement propice à l'enseignement et à la recherche.",
                "en": "ISETSF is located in Sfax, Tunisia, offering an environment conducive to teaching and research."
            }
        },
        {
            "question": {
                "fr": "Depuis quand l'ISETSF existe-t-il ?",
                "en": "Since when has ISETSF existed?"
            },
            "reponse": {
                "fr": "L'ISETSF a été fondé pour répondre à la demande croissante de formation technologique en Tunisie.",
                "en": "ISETSF was founded to meet the growing demand for technological training in Tunisia."
            }
        },
        {
            "question": {
                "fr": "Quels domaines d'études sont proposés par l'ISETSF ?",
                "en": "What fields of study are offered by ISETSF?"
            },
            "reponse": {
                "fr": "Les domaines incluent l'informatique, l'électronique, la mécanique et bien d'autres secteurs technologiques.",
                "en": "The fields include computer science, electronics, mechanics, and many other technological sectors."
            }
        },
        {
            "question": {
                "fr": "Quels sont les objectifs éducatifs de l'ISETSF ?",
                "en": "What are the educational objectives of ISETSF?"
            },
            "reponse": {
                "fr": "L'institution vise à combiner théorie et pratique pour préparer efficacement les étudiants aux défis professionnels.",
                "en": "The institution aims to combine theory and practice to effectively prepare students for professional challenges."
            }
        },
        {
            "question": {
                "fr": "Quels types de diplômes l'ISETSF propose-t-il ?",
                "en": "What types of degrees does ISETSF offer?"
            },
            "reponse": {
                "fr": "L'ISETSF propose des diplômes de technicien supérieur ainsi que des programmes de formation continue.",
                "en": "ISETSF offers higher technician degrees as well as continuing education programs."
            }
        },
        {
            "question": {
                "fr": "Comment l'ISETSF contribue-t-il au développement régional ?",
                "en": "How does ISETSF contribute to regional development?"
            },
            "reponse": {
                "fr": "En collaborant avec les industries locales et en favorisant l'innovation, l'ISETSF soutient le développement économique régional.",
                "en": "By collaborating with local industries and promoting innovation, ISETSF supports regional economic development."
            }
        },
        {
            "question": {
                "fr": "Quel est le rôle de l'ISETSF dans l'innovation technologique ?",
                "en": "What is ISETSF's role in technological innovation?"
            },
            "reponse": {
                "fr": "L'ISETSF encourage la recherche appliquée et le transfert de technologie pour stimuler l'innovation.",
                "en": "ISETSF encourages applied research and technology transfer to stimulate innovation."
            }
        },
        {
            "question": {
                "fr": "Quelles partenariats internationaux l'ISETSF a-t-il ?",
                "en": "What international partnerships does ISETSF have?"
            },
            "reponse": {
                "fr": "L'ISETSF collabore avec plusieurs universités et centres de recherche à travers le monde.",
                "en": "ISETSF collaborates with several universities and research centers around the world."
            }
        }
            ]
        },
        "departements": {
            "titre": {
                "fr": "Départements et Formations",
                "en": "Departments and Programs"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quels sont les différents départements de l'ISET Sfax ?",
                        "en": "What are the different departments at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": [
                            "Département des Sciences Économiques et de Gestion",
                            "Département des Technologies de l'Informatique",
                            "Département du Génie des Procédés",
                            "Département du Génie Civil",
                            "Département du Génie Mécanique"
                        ],
                        "en": [
                            "Department of Economics and Management",
                            "Department of Computer Technologies",
                            "Department of Process Engineering",
                            "Department of Civil Engineering",
                            "Department of Mechanical Engineering"
                        ]
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les informations sur le département des Sciences Économiques et de Gestion ?",
                        "en": "What information is available about the Department of Economics and Management?"
                    },
                    "reponse": {
                        "fr": {
                            "chef_departement": {
                                "nom": "Najoua ALOUI",
                                "email": "aloui.najoua2020@gmail.com",
                                "telephone": "74431495"
                            },
                            "secretaire": "Nadia KAMMOUN",
                            "formations": {
                                "licences": [
                                    {
                                        "nom": "Comptabilité et Finance",
                                        "specialite": "Techniques comptables et financières"
                                    },
                                    {
                                        "nom": "Commerce et Distribution",
                                        "specialite": "Techniques de vente"
                                    },
                                    {
                                        "nom": "Administration des Affaires",
                                        "specialites": [
                                            "Management industriel",
                                            "Logistique et transport",
                                            "Qualité Hygiène Sécurité et environnement"
                                        ]
                                    }
                                ],
                                "masters": [
                                    {
                                        "nom": "Innovation et Supply Chain Management (ISCM)",
                                        "lien_candidature": "https://isetsf.rnu.tn/fr/formation/candidature-en-mastere-professionnel"
                                    },
                                    {
                                        "nom": "Management Intégré Qualité, Sécurité au travail et Environnement (MIQSSE)",
                                        "lien_candidature": "https://isetsf.rnu.tn/fr/formation/candidature-en-mastere-professionnel"
                                    }
                                ]
                            }
                        },
                        "en": {
                            "department_head": {
                                "name": "Najoua ALOUI",
                                "email": "aloui.najoua2020@gmail.com",
                                "phone": "74431495"
                            },
                            "secretary": "Nadia KAMMOUN",
                            "programs": {
                                "bachelor_degrees": [
                                    {
                                        "name": "Accounting and Finance",
                                        "specialization": "Accounting and financial techniques"
                                    },
                                    {
                                        "name": "Commerce and Distribution",
                                        "specialization": "Sales techniques"
                                    },
                                    {
                                        "name": "Business Administration",
                                        "specializations": [
                                            "Industrial management",
                                            "Logistics and transport",
                                            "Quality, Hygiene, Safety and Environment"
                                        ]
                                    }
                                ],
                                "masters": [
                                    {
                                        "name": "Innovation and Supply Chain Management (ISCM)",
                                        "application_link": "https://isetsf.rnu.tn/fr/formation/candidature-en-mastere-professionnel"
                                    },
                                    {
                                        "name": "Integrated Management of Quality, Occupational Safety and Environment (MIQSSE)",
                                        "application_link": "https://isetsf.rnu.tn/fr/formation/candidature-en-mastere-professionnel"
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les informations sur le département des Technologies de l'Informatique ?",
                        "en": "What information is available about the Department of Computer Technologies?"
                    },
                    "reponse": {
                        "fr": {
                            "chef_departement": {
                                "nom": "Mohamed ELLEUCH",
                                "email": "elleuch_med@yahoo.fr",
                                "telephone": "74431425/74431182"
                            },
                            "secretaire": "Amel BOURICHA",
                            "presentation": "Le Département Technologies de l'Informatique de l'ISET de Sfax est un département créé en septembre 2008 suite à la fusion des départements Informatique et STID. Il a une capacité d'accueil de 800 étudiants.",
                            "formations": {
                                "licences": [
                                    {
                                        "nom": "Développement des Systèmes Informatiques (DSI)",
                                        "orientation": "Informatique de gestion"
                                    },
                                    {
                                        "nom": "Réseaux et Systèmes Informatiques (RSI)",
                                        "orientation": "Réseaux informatiques"
                                    },
                                    {
                                        "nom": "Systèmes Embarqués et Mobiles (SEM)",
                                        "orientation": "Systèmes numériques embarqués"
                                    }
                                ],
                                "masters": [
                                    {
                                        "nom": "Développement des Systèmes d'Informations et Réseaux (DSIR)",
                                        "specialites": [
                                            "Génie Logiciel et Nouvelles Technologies",
                                            "Développement IoT"
                                        ]
                                    },
                                    {
                                        "nom": "Administration des Systèmes, Sécurité et Cloud Computing (ASSC)",
                                        "specialites": [
                                            "Sécurité Informatique",
                                            "Cloud Computing"
                                        ]
                                    }
                                ]
                            }
                        },
                        "en": {
                            "department_head": {
                                "name": "Mohamed ELLEUCH",
                                "email": "elleuch_med@yahoo.fr",
                                "phone": "74431425/74431182"
                            },
                            "secretary": "Amel BOURICHA",
                            "presentation": "The Computer Technologies Department of ISET Sfax was created in September 2008 following the merger of the Computer Science and STID departments. It has a capacity of 800 students.",
                            "programs": {
                                "bachelor_degrees": [
                                    {
                                        "name": "Information Systems Development (DSI)",
                                        "orientation": "Business computing"
                                    },
                                    {
                                        "name": "Networks and Information Systems (RSI)",
                                        "orientation": "Computer networks"
                                    },
                                    {
                                        "name": "Embedded and Mobile Systems (SEM)",
                                        "orientation": "Embedded digital systems"
                                    }
                                ],
                                "masters": [
                                    {
                                        "name": "Information Systems and Networks Development (DSIR)",
                                        "specializations": [
                                            "Software Engineering and New Technologies",
                                            "IoT Development"
                                        ]
                                    },
                                    {
                                        "name": "Systems Administration, Security and Cloud Computing (ASSC)",
                                        "specializations": [
                                            "Computer Security",
                                            "Cloud Computing"
                                        ]
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Comment puis-je contacter mon professeur ?",
                        "en": "How can I contact my professor?"
                    },
                    "reponse": {
                        "fr": "Les professeurs partagent généralement leurs coordonnées et leurs heures de bureau sur le syllabus du cours. Vous pouvez les joindre par email, pendant les heures de bureau programmées, ou sur rendez-vous. De nombreux professeurs utilisent également le système de gestion de l'apprentissage pour les communications liées au cours. Le bureau du département peut fournir des coordonnées si nécessaire.",
                        "en": "Professors typically share their contact information and office hours on the course syllabus. You can reach them via email, during scheduled office hours, or by appointment. Many professors also use the learning management system for course-related communications. The department office can provide contact information if needed."
                    }
                },
                {
                    "question": {
                        "fr": "Qui sont les professeurs du département des Technologies de l'Informatique ?",
                        "en": "Who are the professors in the Computer Technologies department?"
                    },
                    "reponse": {
                        "fr": {
                            "professeurs": [
                                {
                                    "nom": "Malek Chaari",
                                    "email": "chaarimelek@gmail.com",
                                    "grade": "Assistant"
                                },
                                {
                                    "nom": "Anwar Boukattaya",
                                    "email": "boukettayaanwaar@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Dalila Cheriti",
                                    "email": "chedalila@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Esleh Elachtar",
                                    "email": "slachtar@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Fatma Laribi",
                                    "email": "fatma.laribi@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Hafedh Souissi",
                                    "email": "souissi.hafedh17@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Hedi Hmani",
                                    "email": "hedi.hmani@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Imen Daoud",
                                    "email": "daoud_imen@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Imen Megdiche",
                                    "email": "megdich.imen@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Ines Nejar",
                                    "email": "louzelobna@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Lilia Ayadi",
                                    "email": "Lilia_ay_zr@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Malika Elmonser",
                                    "email": "Non disponible",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Manel Ben Salah",
                                    "email": "manel.bensalah@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Mohamed Ahmad Ben Younes",
                                    "email": "benyounes_ahmed@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Mohamed Ben Chikha",
                                    "email": "Non disponible",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Mohamed Elleuch",
                                    "email": "elleuch_med@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Mohamed Zayani",
                                    "email": "mohammad.zayyeni@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Naima Zghal",
                                    "email": "naima.halouani@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Oussama Mallouli",
                                    "email": "Mellouli.oussama@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Sonia Lahiani",
                                    "email": "lahiani_sonia@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Walid Dhouib",
                                    "email": "dhouib.walid@gmail.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Yousri Fakhfakh",
                                    "email": "isyousri@yahoo.fr",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Zied Hamdi",
                                    "email": "hamdi-bacha@webmails.com",
                                    "grade": "Technologue"
                                },
                                {
                                    "nom": "Raoudha Djemal",
                                    "email": "Raoudha_abid@yahoo.fr",
                                    "grade": "Professeur d'Enseignement Secondaire"
                                },
                                {
                                    "nom": "Salma Kammoun",
                                    "email": "salma.kammoun97@yahoo.fr",
                                    "grade": "Professeur d'Enseignement Secondaire"
                                },
                                {
                                    "nom": "Wassim Jerbi",
                                    "email": "jerbij@yahoo.fr",
                                    "grade": "Professeur d'Enseignement Secondaire"
                                },
                                {
                                    "nom": "Slim Rekik",
                                    "email": "Non disponible",
                                    "grade": "Professeur Agrégé"
                                },
                                {
                                    "nom": "Abderrahmen Guermazi",
                                    "email": "abguermazi@gmail.com",
                                    "grade": "Professeur Technologue"
                                },
                                {
                                    "nom": "Afef Ellouze",
                                    "email": "samet_afef@yahoo.fr",
                                    "grade": "Professeur Technologue"
                                },
                                {
                                    "nom": "Atef Boubaker",
                                    "email": "atef.boubaker@yahoo.fr",
                                    "grade": "Professeur Technologue"
                                },
                                {
                                    "nom": "Hounaida Moalla",
                                    "email": "hounaida.fourati@yahoo.fr",
                                    "grade": "Professeur Technologue"
                                },
                                {
                                    "nom": "Lotfi Tlili",
                                    "email": "tlili.lotfi@yahoo.fr",
                                    "grade": "Professeur Technologue"
                                },
                                {
                                    "nom": "Mondher Hdiji",
                                    "email": "mondherhadiji@gmail.com",
                                    "grade": "Professeur Technologue"
                                },
                                {
                                    "nom": "Ahmed Jemal",
                                    "email": "jmlhmd@gmail.com",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Anis Borcheni",
                                    "email": "borchani_anis@yahoo.fr",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Azer Zairi",
                                    "email": "azer.zairi@gmail.com",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Faiez Charfi",
                                    "email": "faiez.charfi@gmail.com",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Habib Chakchouk",
                                    "email": "chakchouk@gmail.com",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Hassen Ben Ayed",
                                    "email": "hassan.abdessalem.benayed@gmail.com",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Hassen Ben Rebah",
                                    "email": "ben_rebah_h@yahoo.fr",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Hassen Hachicha",
                                    "email": "hachicha.hs@gmail.com",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Hayet Lamine",
                                    "email": "lamine_hayet@yahoo.fr",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Hbib Amouri",
                                    "email": "habib.amouri@isetsf.rnu.tn",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Hedia Affes",
                                    "email": "Hedia.affes@yahoo.fr",
                                    "grade": "Maître Technologue"
                                },
                                {
                                    "nom": "Malek Zribi",
                                    "email": "Malek_zribi@yahoo.fr",
                                    "grade": "Maître Technologue"
                                }
                            ]
                        },
                        "en": {
                            "professors": [
                                {
                                    "name": "Malek Chaari",
                                    "email": "chaarimelek@gmail.com",
                                    "rank": "Assistant"
                                },
                                {
                                    "name": "Anwar Boukattaya",
                                    "email": "boukettayaanwaar@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Dalila Cheriti",
                                    "email": "chedalila@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Esleh Elachtar",
                                    "email": "slachtar@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Fatma Laribi",
                                    "email": "fatma.laribi@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Hafedh Souissi",
                                    "email": "souissi.hafedh17@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Hedi Hmani",
                                    "email": "hedi.hmani@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Imen Daoud",
                                    "email": "daoud_imen@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Imen Megdiche",
                                    "email": "megdich.imen@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Ines Nejar",
                                    "email": "louzelobna@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Lilia Ayadi",
                                    "email": "Lilia_ay_zr@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Malika Elmonser",
                                    "email": "Not available",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Manel Ben Salah",
                                    "email": "manel.bensalah@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Mohamed Ahmad Ben Younes",
                                    "email": "benyounes_ahmed@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Mohamed Ben Chikha",
                                    "email": "Not available",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Mohamed Elleuch",
                                    "email": "elleuch_med@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Mohamed Zayani",
                                    "email": "mohammad.zayyeni@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Naima Zghal",
                                    "email": "naima.halouani@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Oussama Mallouli",
                                    "email": "Mellouli.oussama@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Sonia Lahiani",
                                    "email": "lahiani_sonia@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Walid Dhouib",
                                    "email": "dhouib.walid@gmail.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Yousri Fakhfakh",
                                    "email": "isyousri@yahoo.fr",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Zied Hamdi",
                                    "email": "hamdi-bacha@webmails.com",
                                    "rank": "Technologist"
                                },
                                {
                                    "name": "Raoudha Djemal",
                                    "email": "Raoudha_abid@yahoo.fr",
                                    "rank": "Secondary Education Professor"
                                },
                                {
                                    "name": "Salma Kammoun",
                                    "email": "salma.kammoun97@yahoo.fr",
                                    "rank": "Secondary Education Professor"
                                },
                                {
                                    "name": "Wassim Jerbi",
                                    "email": "jerbij@yahoo.fr",
                                    "rank": "Secondary Education Professor"
                                },
                                {
                                    "name": "Slim Rekik",
                                    "email": "Not available",
                                    "rank": "Associate Professor"
                                },
                                {
                                    "name": "Abderrahmen Guermazi",
                                    "email": "abguermazi@gmail.com",
                                    "rank": "Professor Technologist"
                                },
                                {
                                    "name": "Afef Ellouze",
                                    "email": "samet_afef@yahoo.fr",
                                    "rank": "Professor Technologist"
                                },
                                {
                                    "name": "Atef Boubaker",
                                    "email": "atef.boubaker@yahoo.fr",
                                    "rank": "Professor Technologist"
                                },
                                {
                                    "name": "Hounaida Moalla",
                                    "email": "hounaida.fourati@yahoo.fr",
                                    "rank": "Professor Technologist"
                                },
                                {
                                    "name": "Lotfi Tlili",
                                    "email": "tlili.lotfi@yahoo.fr",
                                    "rank": "Professor Technologist"
                                },
                                {
                                    "name": "Mondher Hdiji",
                                    "email": "mondherhadiji@gmail.com",
                                    "rank": "Professor Technologist"
                                },
                                {
                                    "name": "Ahmed Jemal",
                                    "email": "jmlhmd@gmail.com",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Anis Borcheni",
                                    "email": "borchani_anis@yahoo.fr",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Azer Zairi",
                                    "email": "azer.zairi@gmail.com",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Faiez Charfi",
                                    "email": "faiez.charfi@gmail.com",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Habib Chakchouk",
                                    "email": "chakchouk@gmail.com",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Hassen Ben Ayed",
                                    "email": "hassan.abdessalem.benayed@gmail.com",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Hassen Ben Rebah",
                                    "email": "ben_rebah_h@yahoo.fr",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Hassen Hachicha",
                                    "email": "hachicha.hs@gmail.com",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Hayet Lamine",
                                    "email": "lamine_hayet@yahoo.fr",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Hbib Amouri",
                                    "email": "habib.amouri@isetsf.rnu.tn",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Hedia Affes",
                                    "email": "Hedia.affes@yahoo.fr",
                                    "rank": "Master Technologist"
                                },
                                {
                                    "name": "Malek Zribi",
                                    "email": "Malek_zribi@yahoo.fr",
                                    "rank": "Master Technologist"
                                }
                            ]
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les formations proposées par le département des Technologies de l'Informatique ?",
                        "en": "What programs are offered by the Computer Technologies department?"
                    },
                    "reponse": {
                        "fr": {
                            "licences": [
                                {
                                    "nom": "Développement des Systèmes Informatiques (DSI)",
                                    "specialite": "Informatique de gestion",
                                    "presentation": "Formation axée sur le développement d'applications et la gestion de systèmes d'information",
                                    "objectifs": {
                                        "general": "Former des techniciens supérieurs en développement informatique",
                                        "specifiques": [
                                            "Maîtriser les langages de programmation",
                                            "Concevoir et développer des applications",
                                            "Gérer des bases de données"
                                        ]
                                    },
                                    "plan_etudes": {
                                        "semestres": [
                                            {
                                                "modules": [
                                                    {
                                                        "nom": "Algorithmique et Programmation",
                                                        "volume_horaire": 60,
                                                        "credits": 4,
                                                        "coefficient": 2
                                                    },
                                                    {
                                                        "nom": "Bases de Données",
                                                        "volume_horaire": 45,
                                                        "credits": 3,
                                                        "coefficient": 2
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    "conditions_acces": "Baccalauréat scientifique ou technique",
                                    "metiers": [
                                        "Développeur d'applications",
                                        "Analyste programmeur",
                                        "Administrateur de bases de données"
                                    ]
                                },
                                {
                                    "nom": "Réseaux et Systèmes Informatiques (RSI)",
                                    "specialite": "Réseaux informatiques",
                                    "presentation": "Formation spécialisée dans les réseaux et systèmes informatiques",
                                    "objectifs": {
                                        "general": "Former des techniciens en réseaux et systèmes",
                                        "specifiques": [
                                            "Configurer et administrer des réseaux",
                                            "Sécuriser les systèmes informatiques",
                                            "Gérer l'infrastructure réseau"
                                        ]
                                    },
                                    "plan_etudes": {
                                        "semestres": [
                                            {
                                                "modules": [
                                                    {
                                                        "nom": "Réseaux Informatiques",
                                                        "volume_horaire": 60,
                                                        "credits": 4,
                                                        "coefficient": 2
                                                    },
                                                    {
                                                        "nom": "Sécurité Informatique",
                                                        "volume_horaire": 45,
                                                        "credits": 3,
                                                        "coefficient": 2
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    "conditions_acces": "Baccalauréat scientifique ou technique",
                                    "metiers": [
                                        "Administrateur réseau",
                                        "Technicien en sécurité informatique",
                                        "Ingénieur systèmes et réseaux"
                                    ]
                                }
                            ],
                            "masters": [
                                {
                                    "nom": "Développement des Systèmes d'Informations et Réseaux (DSIR)",
                                    "coordinateur": {
                                        "nom": "Mohamed Elleuch",
                                        "email": "elleuch_med@yahoo.fr"
                                    },
                                    "comite_direction": [
                                        "Mohamed Elleuch",
                                        "Habib Chakchouk",
                                        "Hassen Ben Ayed"
                                    ],
                                    "presentation": "Master professionnel en développement de systèmes d'information et réseaux",
                                    "points_forts": [
                                        "Certification Cisco",
                                        "Certification Microsoft",
                                        "Projets pratiques avec entreprises"
                                    ],
                                    "matieres": [
                                        "Architecture des systèmes d'information",
                                        "Développement web avancé",
                                        "Sécurité des réseaux",
                                        "Cloud computing"
                                    ],
                                    "objectifs": {
                                        "general": "Former des experts en développement et réseaux",
                                        "specifiques": [
                                            "Maîtriser les technologies web avancées",
                                            "Concevoir des architectures distribuées",
                                            "Gérer des projets informatiques"
                                        ]
                                    },
                                    "organisation": "4 semestres avec stages en entreprise",
                                    "plan_etudes": {
                                        "lien": "https://isetsf.rnu.tn/fr/formation/mastere-dsir",
                                        "semestres": [
                                            {
                                                "modules": [
                                                    {
                                                        "nom": "Architecture des SI",
                                                        "volume_horaire": 60,
                                                        "credits": 4,
                                                        "coefficient": 2
                                                    },
                                                    {
                                                        "nom": "Développement Web Avancé",
                                                        "volume_horaire": 45,
                                                        "credits": 3,
                                                        "coefficient": 2
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    "specialite": "Développement et Réseaux",
                                    "conditions_acces": "Licence en informatique ou équivalent",
                                    "candidature": {
                                        "description": "Dépôt de dossier en ligne",
                                        "lien": "https://isetsf.rnu.tn/fr/formation/candidature-en-mastere-professionnel"
                                    }
                                }
                            ],
                            "formation_continue": {
                                "licences": [
                                    "Développement des Systèmes Informatiques",
                                    "Réseaux et Systèmes Informatiques"
                                ],
                                "masters": [
                                    {
                                        "nom": "Développement des Systèmes d'Informations et Réseaux",
                                        "coordinateur": {
                                            "nom": "Mohamed Elleuch",
                                            "email": "elleuch_med@yahoo.fr"
                                        },
                                        "comite_direction": [
                                            "Mohamed Elleuch",
                                            "Habib Chakchouk",
                                            "Hassen Ben Ayed"
                                        ],
                                        "presentation": "Formation continue en développement et réseaux",
                                        "points_forts": [
                                            "Adapté aux professionnels",
                                            "Horaires flexibles",
                                            "Projets pratiques"
                                        ],
                                        "matieres": [
                                            "Architecture des SI",
                                            "Développement Web",
                                            "Réseaux et Sécurité"
                                        ],
                                        "objectifs": {
                                            "general": "Mise à niveau des compétences",
                                            "specifiques": [
                                                "Actualisation des connaissances",
                                                "Développement de nouvelles compétences",
                                                "Adaptation aux nouvelles technologies"
                                            ]
                                        },
                                        "organisation": "Cours du soir et weekends",
                                        "plan_etudes": {
                                            "lien": "https://isetsf.rnu.tn/fr/formation/formation-continue",
                                            "semestres": [
                                                {
                                                    "modules": [
                                                        {
                                                            "nom": "Technologies Web",
                                                            "volume_horaire": 45,
                                                            "credits": 3,
                                                            "coefficient": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        "specialite": "Développement et Réseaux",
                                        "conditions_acces": "Expérience professionnelle requise",
                                        "candidature": {
                                            "description": "Dépôt de dossier en ligne",
                                            "lien": "https://isetsf.rnu.tn/fr/formation/formation-continue"
                                        }
                                    }
                                ]
                            }
                        },
                        "en": {
                            "bachelor_degrees": [
                                {
                                    "name": "Information Systems Development (DSI)",
                                    "specialization": "Business computing",
                                    "presentation": "Program focused on application development and information systems management",
                                    "objectives": {
                                        "general": "Train senior technicians in computer development",
                                        "specific": [
                                            "Master programming languages",
                                            "Design and develop applications",
                                            "Manage databases"
                                        ]
                                    },
                                    "study_plan": {
                                        "semesters": [
                                            {
                                                "modules": [
                                                    {
                                                        "name": "Algorithms and Programming",
                                                        "hours": 60,
                                                        "credits": 4,
                                                        "coefficient": 2
                                                    },
                                                    {
                                                        "name": "Databases",
                                                        "hours": 45,
                                                        "credits": 3,
                                                        "coefficient": 2
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    "admission_requirements": "Scientific or technical high school diploma",
                                    "careers": [
                                        "Application developer",
                                        "Programmer analyst",
                                        "Database administrator"
                                    ]
                                }
                            ],
                            "masters": [
                                {
                                    "name": "Information Systems and Networks Development (DSIR)",
                                    "coordinator": {
                                        "name": "Mohamed Elleuch",
                                        "email": "elleuch_med@yahoo.fr"
                                    },
                                    "management_committee": [
                                        "Mohamed Elleuch",
                                        "Habib Chakchouk",
                                        "Hassen Ben Ayed"
                                    ],
                                    "presentation": "Professional master's in information systems and networks development",
                                    "strengths": [
                                        "Cisco certification",
                                        "Microsoft certification",
                                        "Practical projects with companies"
                                    ],
                                    "subjects": [
                                        "Information systems architecture",
                                        "Advanced web development",
                                        "Network security",
                                        "Cloud computing"
                                    ],
                                    "objectives": {
                                        "general": "Train experts in development and networks",
                                        "specific": [
                                            "Maîtriser les technologies web avancées",
                                            "Concevoir des architectures distribuées",
                                            "Gérer des projets informatiques"
                                        ]
                                    },
                                    "organization": "4 semesters with company internships",
                                    "study_plan": {
                                        "link": "https://isetsf.rnu.tn/fr/formation/mastere-dsir",
                                        "semesters": [
                                            {
                                                "modules": [
                                                    {
                                                        "name": "IS Architecture",
                                                        "volume_horaire": 60,
                                                        "credits": 4,
                                                        "coefficient": 2
                                                    },
                                                    {
                                                        "name": "Advanced Web Development",
                                                        "volume_horaire": 45,
                                                        "credits": 3,
                                                        "coefficient": 2
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    "specialization": "Development and Networks",
                                    "admission_requirements": "Bachelor's in computer science or equivalent",
                                    "application": {
                                        "description": "Online application",
                                        "link": "https://isetsf.rnu.tn/fr/formation/candidature-en-mastere-professionnel"
                                    }
                                }
                            ],
                            "continuing_education": {
                                "bachelor_degrees": [
                                    "Information Systems Development",
                                    "Networks and Information Systems"
                                ],
                                "masters": [
                                    {
                                        "name": "Information Systems and Networks Development",
                                        "coordinator": {
                                            "name": "Mohamed Elleuch",
                                            "email": "elleuch_med@yahoo.fr"
                                        },
                                        "management_committee": [
                                            "Mohamed Elleuch",
                                            "Habib Chakchouk",
                                            "Hassen Ben Ayed"
                                        ],
                                        "presentation": "Continuing education in development and networks",
                                        "strengths": [
                                            "Adapted for professionals",
                                            "Flexible schedules",
                                            "Practical projects"
                                        ],
                                        "subjects": [
                                            "IS Architecture",
                                            "Web Development",
                                            "Networks and Security"
                                        ],
                                        "objectives": {
                                            "general": "Skills upgrading",
                                            "specific": [
                                                "Knowledge updating",
                                                "New skills development",
                                                "Adaptation to new technologies"
                                            ]
                                        },
                                        "organization": "Evening and weekend classes",
                                        "study_plan": {
                                            "link": "https://isetsf.rnu.tn/fr/formation/formation-continue",
                                            "semesters": [
                                                {
                                                    "modules": [
                                                        {
                                                            "name": "Web Technologies",
                                                            "volume_horaire": 45,
                                                            "credits": 3,
                                                            "coefficient": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        "specialization": "Development and Networks",
                                        "admission_requirements": "Professional experience required",
                                        "application": {
                                            "description": "Online application",
                                            "link": "https://isetsf.rnu.tn/fr/formation/formation-continue"
                                        }
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les informations sur les autres départements (Génie des Procédés, Génie Civil, Génie Mécanique) ?",
                        "en": "What information is available about the other departments (Process Engineering, Civil Engineering, Mechanical Engineering)?"
                    },
                    "reponse": {
                        "fr": {
                            "genie_procedes": {
                                "chef": {
                                    "nom": "Yasser RAHMANI",
                                    "email": "rahmaniyasser@gmail.com",
                                    "telephone": "22644342"
                                },
                                "secretaire": "Houssin HADDAD",
                                "formations": ["Procédés Chimiques (PC)", "Procédés Agroalimentaires (PA)"]
                            },
                            "genie_civil": {
                                "chef": {
                                    "nom": "Ali BOULILA",
                                    "email": "ali.boulila21@gmail.com"
                                }
                            },
                            "genie_mecanique": {
                                "chef": {
                                    "nom": "Kamel GUEMRI",
                                    "email": "kamel.guemri@sfax.r-iset.tn"
                                },
                                "formations": [
                                    "Conception et Fabrication Mécanique (CFM)",
                                    "Construction Métallique (CM)",
                                    "Energétique (EN)",
                                    "Maintenance Industrielle (MI)"
                                ],
                                "master": "Instrumentation des Processus et Procédés Industriels (IPPI)"
                            }
                        },
                        "en": {
                            "process_engineering": {
                                "head": {
                                    "name": "Yasser RAHMANI",
                                    "email": "rahmaniyasser@gmail.com",
                                    "phone": "22644342"
                                },
                                "secretary": "Houssin HADDAD",
                                "programs": ["Chemical Processes (PC)", "Food Processing (PA)"]
                            },
                            "civil_engineering": {
                                "head": {
                                    "name": "Ali BOULILA",
                                    "email": "ali.boulila21@gmail.com"
                                }
                            },
                            "mechanical_engineering": {
                                "head": {
                                    "name": "Kamel GUEMRI",
                                    "email": "kamel.guemri@sfax.r-iset.tn"
                                },
                                "programs": [
                                    "Mechanical Design and Manufacturing (CFM)",
                                    "Metal Construction (CM)",
                                    "Energy Engineering (EN)",
                                    "Industrial Maintenance (MI)"
                                ],
                                "master": "Industrial Processes and Procedures Instrumentation (IPPI)"
                            }
                        }
                    }
                }
            ]
        },
        "associations": {
            "titre": {
                "fr": "Associations et Vie Étudiante",
                "en": "Associations and Student Life"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quelles sont les associations présentes à l'ISET Sfax ?",
                        "en": "What associations are present at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": [
                            {
                                "nom": "Association des Anciens de l'ISET de Sfax (2AISF)",
                                "president": {
                                    "nom": "Nabil KAMMOUN",
                                    "email": "nabil.kammoun@gmail.com"
                                },
                                "presentation": "Association qui regroupe les anciens étudiants de l'ISET Sfax",
                                "objectifs": [
                                    "Maintenir le contact entre les anciens étudiants",
                                    "Faciliter l'insertion professionnelle",
                                    "Organiser des événements et rencontres"
                                ],
                                "contact": {
                                    "adresse": "ISET Sfax, Route Mahdia Km 2.5",
                                    "email": "contact@2aisf.org",
                                    "telephone": "+216 74 240 600"
                                }
                            }
                        ],
                        "en": [
                            {
                                "name": "ISET Sfax Alumni Association (2AISF)",
                                "president": {
                                    "name": "Nabil KAMMOUN",
                                    "email": "nabil.kammoun@gmail.com"
                                },
                                "presentation": "Association that brings together ISET Sfax alumni",
                                "objectives": [
                                    "Maintain contact between alumni",
                                    "Facilitate professional integration",
                                    "Organize events and meetings"
                                ],
                                "contact": {
                                    "address": "ISET Sfax, Mahdia Road Km 2.5",
                                    "email": "contact@2aisf.org",
                                    "phone": "+216 74 240 600"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "projets": {
            "titre": {
                "fr": "Projets et Partenariats",
                "en": "Projects and Partnerships"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quels sont les principaux projets de l'ISET Sfax ?",
                        "en": "What are the main projects at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": [
                            {
                                "nom": "Projet de Modernisation de l'Enseignement Supérieur",
                                "description": "Projet visant à améliorer la qualité de l'enseignement et l'employabilité des diplômés",
                                "partenaires": [
                                    "Ministère de l'Enseignement Supérieur",
                                    "Union Européenne",
                                    "Entreprises locales"
                                ]
                            }
                        ],
                        "en": [
                            {
                                "name": "Higher Education Modernization Project",
                                "description": "Project aimed at improving teaching quality and graduate employability",
                                "partners": [
                                    "Ministry of Higher Education",
                                    "European Union",
                                    "Local companies"
                                ]
                            }
                        ]
                    }
                }
            ]
        },
        "entreprises": {
            "titre": {
                "fr": "Relations Entreprises",
                "en": "Business Relations"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Comment les entreprises peuvent-elles collaborer avec l'ISET Sfax ?",
                        "en": "How can companies collaborate with ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "compte_professionnel": {
                                "presentation": "Les entreprises peuvent créer un compte professionnel pour accéder à différents services",
                                "avantages": [
                                    "Accès aux CV des étudiants",
                                    "Publication d'offres de stages et d'emplois",
                                    "Participation aux événements professionnels"
                                ]
                            },
                            "types_collaboration": [
                                "Stages étudiants",
                                "Projets de fin d'études",
                                "Formation continue",
                                "Projets de recherche appliquée"
                            ]
                        },
                        "en": {
                            "professional_account": {
                                "presentation": "Companies can create a professional account to access various services",
                                "benefits": [
                                    "Access to student CVs",
                                    "Publication of internship and job offers",
                                    "Participation in professional events"
                                ]
                            },
                            "collaboration_types": [
                                "Student internships",
                                "Final year projects",
                                "Continuing education",
                                "Applied research projects"
                            ]
                        }
                    }
                }
            ]
        },
        "procedures_administratives": {
            "titre": {
                "fr": "Procédures Administratives",
                "en": "Administrative Procedures"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Comment s'inscrire à l'ISET Sfax ?",
                        "en": "How to enroll at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "etapes": [
                                "1. Obtenir une orientation via la plateforme nationale",
                                "2. Se présenter au bureau d'inscription avec les documents requis",
                                "3. Payer les frais d'inscription",
                                "4. Récupérer la carte d'étudiant"
                            ],
                            "documents_requis": [
                                "Copie du baccalauréat",
                                "Extrait de naissance",
                                "Photos d'identité",
                                "Copie de la CIN",
                                "Fiche de renseignements"
                            ]
                        },
                        "en": {
                            "steps": [
                                "1. Get orientation through the national platform",
                                "2. Visit the registration office with required documents",
                                "3. Pay registration fees",
                                "4. Collect student ID card"
                            ],
                            "required_documents": [
                                "Copy of high school diploma",
                                "Birth certificate",
                                "ID photos",
                                "Copy of national ID card",
                                "Information form"
                            ]
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Comment obtenir un certificat de scolarité ?",
                        "en": "How to obtain a certificate of enrollment?"
                    },
                    "reponse": {
                        "fr": {
                            "procedure": "Se présenter au bureau de scolarité avec la carte d'étudiant",
                            "delai": "24-48 heures",
                            "cout": "Gratuit"
                        },
                        "en": {
                            "procedure": "Visit the student affairs office with your student ID card",
                            "timeframe": "24-48 hours",
                            "cost": "Free"
                        }
                    }
                }
            ]
        },
        "acces_information": {
            "titre": {
                "fr": "Accès à l'Information",
                "en": "Access to Information"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Comment accéder aux informations publiques de l'ISET Sfax ?",
                        "en": "How to access public information at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": {
                            "informations_generales": {
                                "description": "Toutes les informations générales sont disponibles sur le site web officiel",
                                "url": "https://www.isetsf.rnu.tn"
                            },
                            "politique": "L'ISET Sfax s'engage à la transparence et à l'accès à l'information conformément à la loi",
                            "references_legales": [
                                "Loi organique n° 2016-22 du 24 mars 2016",
                                "Décret gouvernemental n° 2019-54 du 21 janvier 2019"
                            ],
                            "formulaires": {
                                "description": "Des formulaires de demande d'accès à l'information sont disponibles",
                                "lieu": "Bureau d'ordre ou site web"
                            }
                        },
                        "en": {
                            "general_information": {
                                "description": "All general information is available on the official website",
                                "url": "https://www.isetsf.rnu.tn"
                            },
                            "policy": "ISET Sfax is committed to transparency and access to information in accordance with the law",
                            "legal_references": [
                                "Organic Law No. 2016-22 of March 24, 2016",
                                "Government Decree No. 2019-54 of January 21, 2019"
                            ],
                            "forms": {
                                "description": "Information access request forms are available",
                                "location": "Registry office or website"
                            }
                        }
                    }
                }
            ]
        },
        "infrastructures": {
            "titre": {
                "fr": "Infrastructures et Équipements",
                "en": "Infrastructure and Equipment"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quelles sont les infrastructures disponibles pour les étudiants en Technologies de l'Informatique ?",
                        "en": "What infrastructure is available for Computer Technology students?"
                    },
                    "reponse": {
                        "fr": {
                            "laboratoires": [
                                {
                                    "nom": "Laboratoire de Développement Logiciel",
                                    "equipements": [
                                        "30 postes de travail",
                                        "Serveurs de développement",
                                        "Environnements de développement intégrés"
                                    ],
                                    "logiciels": [
                                        "Visual Studio",
                                        "Eclipse",
                                        "IntelliJ IDEA",
                                        "Git"
                                    ]
                                },
                                {
                                    "nom": "Laboratoire de Réseaux",
                                    "equipements": [
                                        "Routeurs Cisco",
                                        "Switchs",
                                        "Serveurs",
                                        "Équipements de test réseau"
                                    ],
                                    "certifications": "Laboratoire certifié Cisco Academy"
                                },
                                {
                                    "nom": "Laboratoire de Systèmes Embarqués",
                                    "equipements": [
                                        "Kits de développement Arduino",
                                        "Raspberry Pi",
                                        "Capteurs et actionneurs",
                                        "Oscilloscopes"
                                    ]
                                }
                            ],
                            "bibliotheque": {
                                "ressources": [
                                    "Livres techniques",
                                    "Revues spécialisées",
                                    "Accès aux bases de données en ligne",
                                    "Salle de lecture"
                                ],
                                "horaires": "8h-18h du lundi au vendredi"
                            },
                            "espaces_etudiants": [
                                "Salle de travail en groupe",
                                "Espace détente",
                                "Cafétéria",
                                "Salle de sport"
                            ],
                            "connexion": {
                                "wifi": "Couverture totale du campus",
                                "debit": "100 Mbps",
                                "acces": "24/7"
                            }
                        },
                        "en": {
                            "laboratories": [
                                {
                                    "name": "Software Development Laboratory",
                                    "equipment": [
                                        "30 workstations",
                                        "Development servers",
                                        "Integrated development environments"
                                    ],
                                    "software": [
                                        "Visual Studio",
                                        "Eclipse",
                                        "IntelliJ IDEA",
                                        "Git"
                                    ]
                                },
                                {
                                    "name": "Networks Laboratory",
                                    "equipment": [
                                        "Cisco routers",
                                        "Switches",
                                        "Servers",
                                        "Network testing equipment"
                                    ],
                                    "certifications": "Cisco Academy certified laboratory"
                                },
                                {
                                    "name": "Embedded Systems Laboratory",
                                    "equipment": [
                                        "Arduino development kits",
                                        "Raspberry Pi",
                                        "Sensors and actuators",
                                        "Oscilloscopes"
                                    ]
                                }
                            ],
                            "library": {
                                "resources": [
                                    "Technical books",
                                    "Specialized journals",
                                    "Online database access",
                                    "Reading room"
                                ],
                                "hours": "8am-6pm Monday to Friday"
                            },
                            "student_spaces": [
                                "Group work room",
                                "Relaxation area",
                                "Cafeteria",
                                "Sports room"
                            ],
                            "connection": {
                                "wifi": "Full campus coverage",
                                "speed": "100 Mbps",
                                "access": "24/7"
                            }
                        }
                    }
                }
            ]
        },
        "services_etudiants": {
            "titre": {
                "fr": "Services aux Étudiants",
                "en": "Student Services"
            },
            "questions": [
              
              {
                  "question": {
                      "en": "What computer labs are available for design software?",
                      "fr": "Quels laboratoires informatiques sont disponibles pour les logiciels de conception ?"
                  },
                  "reponse": {
                      "en": "Specialized design software (Adobe, CAD, 3D modeling) is available in Labs C-301 and D-105. Hours and equipment specifications at https://www.iset-sfax.tn/facilities/design-labs.",
                      "fr": "Des logiciels de conception spécialisés (Adobe, CAD, modélisation 3D) sont disponibles dans les laboratoires C-301 et D-105. Horaires et spécifications des équipements sur https://www.iset-sfax.tn/facilities/design-labs."
                  }
              },
              {
                  "question": {
                      "en": "How do I get access to research laboratories?",
                      "fr": "Comment obtenir l'accès aux laboratoires de recherche ?"
                  },
                  "reponse": {
                      "en": "Research lab access requires safety training completion and faculty authorization. Submit the access request form at https://www.iset-sfax.tn/facilities/research-labs.",
                      "fr": "L'accès aux laboratoires de recherche nécessite la complétion de la formation en sécurité et l'autorisation de la faculté. Soumettez le formulaire de demande d'accès à https://www.iset-sfax.tn/facilities/research-labs."
                  }
              },
              {
                  "question": {
                      "en": "Where can I store my project materials on campus?",
                      "fr": "Où puis-je stocker mes matériaux de projet sur le campus ?"
                  },
                  "reponse": {
                      "en": "Project storage lockers are available in Buildings B and C on a semester basis. Apply at https://www.iset-sfax.tn/facilities/project-storage. Limited availability, apply early.",
                      "fr": "Des casiers de stockage de projet sont disponibles dans les bâtiments B et C sur une base semestrielle. Inscrivez-vous à https://www.iset-sfax.tn/facilities/project-storage. Disponibilité limitée, postulez tôt."
                  }
              },
              {
                  "question": {
                      "en": "How do I report a facilities maintenance issue?",
                      "fr": "Comment signaler un problème de maintenance des installations ?"
                  },
                  "reponse": {
                      "en": "Maintenance issues can be reported through the Facilities Portal at https://www.iset-sfax.tn/facilities/maintenance or via the ISET mobile app. Include location and detailed description.",
                      "fr": "Les problèmes de maintenance peuvent être signalés via le portail des installations à https://www.iset-sfax.tn/facilities/maintenance ou via l'application mobile ISET. Inclure l'emplacement et une description détaillée."
                  }
              },
              {
                  "question": {
                      "en": "What audio/visual equipment can I borrow?",
                      "fr": "Quel équipement audio/vidéo puis-je emprunter ?"
                  },
                  "reponse": {
                      "en": "A/V equipment including projectors, cameras, and sound systems can be borrowed from Media Services in Building D. Reservation form at https://www.iset-sfax.tn/facilities/av-equipment.",
                      "fr": "L'équipement audio/vidéo, y compris les projecteurs, les caméras et les systèmes audio, peut être emprunté auprès des Services Médias dans le bâtiment D. Formulaire de réservation sur https://www.iset-sfax.tn/facilities/av-equipment."
                  }
              },
              {
                  "question": {
                      "en": "Are there charging stations for electric vehicles?",
                      "fr": "Y a-t-il des stations de recharge pour les véhicules électriques ?"
                  },
                  "reponse": {
                      "en": "Electric vehicle charging stations are located in Parking Lots A and C. Registration and usage instructions at https://www.iset-sfax.tn/facilities/ev-charging. Fee: 2 TND per hour.",
                      "fr": "Les stations de recharge pour véhicules électriques sont situées dans les parkings A et C. Inscription et instructions d'utilisation sur https://www.iset-sfax.tn/facilities/ev-charging. Frais : 2 TND par heure."
                  }
              },
              {
                  "question": {
                      "en": "How do I reserve the conference rooms?",
                      "fr": "Comment réserver les salles de conférence ?"
                  },
                  "reponse": {
                      "en": "Conference rooms for student organizations can be reserved through https://www.iset-sfax.tn/facilities/room-booking. Requests must be submitted at least 48 hours in advance.",
                      "fr": "Les salles de conférence pour les organisations étudiantes peuvent être réservées via https://www.iset-sfax.tn/facilities/room-booking. Les demandes doivent être soumises au moins 48 heures à l'avance."
                  }
              },
              {
                  "question": {
                      "en": "What recreational facilities are available on weekends?",
                      "fr": "Quelles installations récréatives sont disponibles le week-end ?"
                  },
                  "reponse": {
                      "en": "Weekend recreational facilities include the gymnasium, swimming pool, and tennis courts. Hours and reservation process at https://www.iset-sfax.tn/facilities/weekend-recreation.",
                      "fr": "Les installations récréatives du week-end comprennent la salle de sport, la piscine et les courts de tennis. Horaires et processus de réservation sur https://www.iset-sfax.tn/facilities/weekend-recreation."
                  }
              },
              {
                  "question": {
                      "en": "How do I access specialized software in the labs?",
                      "fr": "Comment accéder aux logiciels spécialisés dans les laboratoires ?"
                  },
                  "reponse": {
                      "en": "Specialized software requires account activation through https://www.iset-sfax.tn/facilities/software-access. Training sessions for complex applications are scheduled monthly.",
                      "fr": "Les logiciels spécialisés nécessitent l'activation du compte via https://www.iset-sfax.tn/facilities/software-access. Des sessions de formation pour les applications complexes sont programmées chaque mois."
                  }
              },
              {
                  "question": {
                      "en": "What catering services are available for student events?",
                      "fr": "Quels services de restauration sont disponibles pour les événements étudiants ?"
                  },
                  "reponse": {
                      "en": "Campus catering can be arranged for student events with at least one week's notice. Menus and pricing at https://www.iset-sfax.tn/facilities/catering. Discounts for registered organizations.",
                      "fr": "La restauration sur le campus peut être organisée pour les événements étudiants avec un préavis d'au moins une semaine. Menus et prix sur https://www.iset-sfax.tn/facilities/catering. Remises pour les organisations enregistrées."
                  }
              },
              {
                  "question": {
                      "en": "How do I reserve equipment for field research?",
                      "fr": "Comment réserver du matériel pour la recherche sur le terrain ?"
                  },
                  "reponse": {
                      "en": "Field research equipment reservation requires faculty approval and safety training. Inventory and booking form at https://www.iset-sfax.tn/facilities/field-equipment.",
                      "fr": "La réservation de matériel pour la recherche sur le terrain nécessite l'approbation de la faculté et la formation en sécurité. Inventaire et formulaire de réservation sur https://www.iset-sfax.tn/facilities/field-equipment."
                  }
              },
              {
                  "question": {
                      "en": "What are the hours for the campus copy center?",
                      "fr": "Quels sont les horaires du centre de copie du campus ?"
                  },
                  "reponse": {
                      "en": "The Copy Center operates Monday-Friday 8:00-18:00 and Saturday 9:00-13:00. Services and pricing listed at https://www.iset-sfax.tn/facilities/copy-center.",
                      "fr": "Le centre de copie est ouvert du lundi au vendredi de 8h00 à 18h00 et le samedi de 9h00 à 13h00. Services et tarifs sur https://www.iset-sfax.tn/facilities/copy-center."
                  }
              },
              {
                  "question": {
                      "en": "How do I get after-hours access to buildings?",
                      "fr": "Comment obtenir un accès après les heures d'ouverture aux bâtiments ?"
                  },
                  "reponse": {
                      "en": "After-hours building access requires department authorization and security enrollment. Application form at https://www.iset-sfax.tn/facilities/after-hours with faculty endorsement.",
                      "fr": "L'accès aux bâtiments après les heures d'ouverture nécessite l'autorisation du département et l'inscription à la sécurité. Formulaire de demande à https://www.iset-sfax.tn/facilities/after-hours avec l'aval de la faculté."
                  }
              },
              {
                    "question": {
                        "en": "How do I apply for on-campus housing?",
                        "fr": "Comment postuler pour un logement sur le campus ?"
                    },
                    "reponse": {
                        "en": "On-campus housing applications open April 1st for the following academic year. Apply through https://www.iset-sfax.tn/facilities/housing. Priority given to first-year and international students.",
                        "fr": "Les candidatures pour les logements sur le campus ouvrent le 1er avril pour l'année académique suivante. Postulez sur https://www.iset-sfax.tn/facilities/housing. Priorité aux étudiants de première année et aux étudiants internationaux."
                    }
                },
                {
                    "question": {
                        "en": "How do I report broken lab equipment?",
                        "fr": "Comment signaler du matériel de laboratoire défectueux ?"
                    },
                    "reponse": {
                        "en": "Report malfunctioning equipment through the maintenance portal at https://www.iset-sfax.tn/facilities/maintenance or notify lab staff immediately. Include equipment ID and issue description.",
                        "fr": "Signalez l'équipement défectueux via le portail de maintenance à https://www.iset-sfax.tn/facilities/maintenance ou informez immédiatement le personnel du laboratoire. Incluez l'ID de l'équipement et une description du problème."
                    }
                },
                {
                    "question": {
                        "en": "How do I reset my campus Wi-Fi password?",
                        "fr": "Comment réinitialiser mon mot de passe Wi-Fi du campus ?"
                    },
                    "reponse": {
                        "en": "Reset your Wi-Fi credentials at https://www.iset-sfax.tn/facilities/wifi-reset using your student portal login. For assistance, visit the IT Support desk in Building C with your ID card.",
                        "fr": "Réinitialisez vos identifiants Wi-Fi sur https://www.iset-sfax.tn/facilities/wifi-reset en utilisant vos identifiants du portail étudiant. Pour de l'aide, rendez-vous à l'assistance informatique dans le bâtiment C avec votre carte d'identité."
                    }
                },
                {
                    "question": {
                        "en": "What's the dress code for laboratory sessions?",
                        "fr": "Quel est le code vestimentaire pour les sessions de laboratoire ?"
                    },
                    "reponse": {
                        "en": "Laboratory sessions require closed-toe shoes, long pants, and lab coats. Safety goggles must be worn when handling chemicals. Complete dress code at https://www.iset-sfax.tn/facilities/lab-dress-code.",
                        "fr": "Les sessions de laboratoire nécessitent des chaussures fermées, un pantalon long et une blouse de laboratoire. Des lunettes de sécurité doivent être portées lors de la manipulation de produits chimiques. Le code vestimentaire complet est disponible sur https://www.iset-sfax.tn/facilities/lab-dress-code."
                    }
                },
                {
                    "question": {
                        "en": "Is there a student health clinic on campus?",
                        "fr": "Y a-t-il une clinique de santé pour les étudiants sur le campus ?"
                    },
                    "reponse": {
                        "en": "The Student Health Center is located in Building D. Services include basic medical care, vaccinations, and health counseling. Hours and appointment booking at https://www.iset-sfax.tn/facilities/health-center.",
                        "fr": "Le centre de santé étudiant est situé dans le bâtiment D. Les services incluent des soins médicaux de base, des vaccinations et des conseils en santé. Les horaires et la prise de rendez-vous sont disponibles sur https://www.iset-sfax.tn/facilities/health-center."
                    }
                },
                {
                    "question": {
                        "en": "How do I apply for a parking permit?",
                        "fr": "Comment postuler pour un permis de stationnement ?"
                    },
                    "reponse": {
                        "en": "Parking permits are issued through https://www.iset-sfax.tn/facilities/parking. Annual fee: 100 TND. Submit vehicle registration and student ID. Limited spaces available, apply early.",
                        "fr": "Les permis de stationnement sont délivrés via https://www.iset-sfax.tn/facilities/parking. Frais annuels : 100 TND. Soumettez l'enregistrement du véhicule et la carte d'étudiant. Espaces limités, postulez tôt."
                    }
                },
                {
                    "question": {
                        "en": "How do I find roommates for off-campus housing?",
                        "fr": "Comment trouver des colocataires pour un logement hors campus ?"
                    },
                    "reponse": {
                        "en": "The roommate matching service is available at https://www.iset-sfax.tn/facilities/roommate-finder. Create a profile with your preferences and browse potential matches. Verification required.",
                        "fr": "Le service de mise en relation avec des colocataires est disponible sur https://www.iset-sfax.tn/facilities/roommate-finder. Créez un profil avec vos préférences et explorez les correspondances potentielles. Vérification requise."
                    }
                },
                {
                    "question": {
                        "en": "Are there family housing options available?",
                        "fr": "Y a-t-il des options de logement familial disponibles ?"
                    },
                    "reponse": {
                        "en": "Family housing is limited but available for married students. Application process and eligibility requirements at https://www.iset-sfax.tn/facilities/family-housing. Priority deadline: May 1st.",
                        "fr": "Le logement familial est limité mais disponible pour les étudiants mariés. Le processus de candidature et les critères d'éligibilité sont disponibles sur https://www.iset-sfax.tn/facilities/family-housing. Date limite prioritaire : 1er mai."
                    }
                },
                {
                    "question": {
                        "en": "What are the options for meal plans on campus?",
                        "fr": "Quelles sont les options de plans de repas sur le campus ?"
                    },
                    "reponse": {
                        "en": "Meal plan options range from 5 to 21 meals per week. Pricing and registration at https://www.iset-sfax.tn/facilities/meal-plans. Special dietary accommodations available upon request.",
                        "fr": "Les options de plans de repas varient de 5 à 21 repas par semaine. Tarification et inscription sur https://www.iset-sfax.tn/facilities/meal-plans. Des accommodations diététiques spéciales sont disponibles sur demande."
                    }
                },
                {
                    "question": {
                        "en": "What printing services are available on campus?",
                        "fr": "Quels services d'impression sont disponibles sur le campus ?"
                    },
                    "reponse": {
                        "en": "Printing services include black-and-white and color printing, scanning, and binding. Locations and pricing at https://www.iset-sfax.tn/facilities/printing. Connect via campus Wi-Fi or USB drive.",
                        "fr": "Les services d'impression incluent l'impression en noir et blanc et en couleur, la numérisation et la reliure. Lieux et tarifs sur https://www.iset-sfax.tn/facilities/printing. Connectez-vous via le Wi-Fi du campus ou une clé USB."
                    }
                },
                {
                    "question": {
                        "en": "What software is available for student use?",
                        "fr": "Quel logiciel est disponible pour l'usage des étudiants ?"
                    },
                    "reponse": {
                        "en": "Licensed software includes MATLAB, AutoCAD, Adobe Creative Cloud, and SPSS. Download instructions at https://www.iset-sfax.tn/facilities/software. Available for personal and lab computers.",
                        "fr": "Les logiciels sous licence incluent MATLAB, AutoCAD, Adobe Creative Cloud et SPSS. Instructions de téléchargement sur https://www.iset-sfax.tn/facilities/software. Disponibles pour les ordinateurs personnels et de laboratoire."
                    }
                },
                {
                    "question": {
                        "en": "What fitness facilities are available for students?",
                        "fr": "Quelles installations de fitness sont disponibles pour les étudiants ?"
                    },
                    "reponse": {
                        "en": "Fitness facilities include a gymnasium, pool, tennis courts, and weight room. Hours and equipment reservation at https://www.iset-sfax.tn/facilities/fitness. Group classes schedule posted monthly.",
                        "fr": "Les installations de fitness comprennent une salle de sport, une piscine, des terrains de tennis et une salle de musculation. Horaires et réservation d'équipement sur https://www.iset-sfax.tn/facilities/fitness. Le calendrier des cours collectifs est publié mensuellement."
                    }
                },
                {
                    "question": {
                        "en": "How can I reserve a private room in the library?",
                        "fr": "Comment puis-je réserver une salle privée à la bibliothèque ?"
                    },
                    "reponse": {
                        "en": "Library study rooms can be reserved up to one week in advance for 2-hour blocks. Make bookings at https://www.iset-sfax.tn/facilities/library-rooms or at the circulation desk.",
                        "fr": "Les salles d'étude de la bibliothèque peuvent être réservées jusqu'à une semaine à l'avance pour des créneaux de 2 heures. Effectuez des réservations sur https://www.iset-sfax.tn/facilities/library-rooms ou au bureau de prêt."
                    }
                },
              {
                      "question": {
                    "en": "How do I access the campus WiFi network?",
                    "fr": "Comment accéder au réseau WiFi du campus ?"
                },

                "reponse": {
                    "en": "Connect to 'ISET-Student' network using your student portal credentials. Technical setup guide at https://www.iset-sfax.tn/facilities/wifi. Signal available campus-wide.",
                    "fr": "Connectez-vous au réseau 'ISET-Student' avec vos identifiants du portail étudiant. Guide de configuration technique disponible sur https://www.iset-sfax.tn/facilities/wifi. Signal disponible sur tout le campus."
                }
            },
            {
                "question": {
                    "en": "Are there lockers available for students?",
                    "fr": "Des casiers sont-ils disponibles pour les étudiants ?"
                },
                "reponse": {
                    "en": "Lockers are available in Buildings A, C, and E on first-come basis. Register at https://www.iset-sfax.tn/facilities/lockers. Annual fee: 25 TND.",
                    "fr": "Les casiers sont disponibles dans les bâtiments A, C et E sur la base du premier arrivé, premier servi. Inscription à https://www.iset-sfax.tn/facilities/lockers. Frais annuels : 25 TND."
                }
            },
            {
                "question": {
                    "en": "Where can I find quiet study spaces during peak hours?",
                    "fr": "Où puis-je trouver des espaces d'étude calme pendant les heures de pointe ?"
                },
                "reponse": {
                    "en": "Alternative quiet study spaces include Building F mezzanine, Engineering courtyard, and basement level of Building A. Hours and noise policies at https://www.iset-sfax.tn/facilities/quiet-spaces.",
                    "fr": "Les espaces d'étude calme alternatifs incluent le mezzanine du bâtiment F, la cour des ingénieurs, et le sous-sol du bâtiment A. Horaires et règles de bruit sur https://www.iset-sfax.tn/facilities/quiet-spaces."
                }
            },
            {
                "question": {
                    "en": "Is there equipment I can borrow for class projects?",
                    "fr": "Y a-t-il du matériel que je peux emprunter pour des projets de classe ?"
                },
                "reponse": {
                    "en": "The Equipment Loan Center in Building C loans cameras, microphones, testing equipment, and more. Inventory and borrowing limits listed at https://www.iset-sfax.tn/facilities/equipment-loans.",
                    "fr": "Le Centre de prêt de matériel du bâtiment C prête des caméras, des microphones, des équipements de test, et plus encore. L'inventaire et les limites de prêt sont indiqués sur https://www.iset-sfax.tn/facilities/equipment-loans."
                }
            },
            {
                "question": {
                    "en": "Are there shower facilities for students who commute by bicycle?",
                    "fr": "Y a-t-il des douches pour les étudiants qui viennent à vélo ?"
                },
                "reponse": {
                    "en": "Shower and changing facilities are available in the Sports Complex and Building D basement. Access with student ID. Opening hours at https://www.iset-sfax.tn/facilities/commuter-services.",
                    "fr": "Des installations de douche et de changement sont disponibles au Complexe sportif et au sous-sol du bâtiment D. Accès avec la carte étudiante. Horaires d'ouverture sur https://www.iset-sfax.tn/facilities/commuter-services."
                }
            },
            {
                "question": {
                    "en": "How do I reserve a sports facility for team practice?",
                    "fr": "Comment réserver une installation sportive pour un entraînement d'équipe ?"
                },
                "reponse": {
                    "en": "Sports facility reservations must be made 48 hours in advance through https://www.iset-sfax.tn/facilities/sports-reservations. Student group bookings receive priority on weekdays.",
                    "fr": "Les réservations des installations sportives doivent être effectuées 48 heures à l'avance sur https://www.iset-sfax.tn/facilities/sports-reservations. Les réservations de groupes étudiants sont prioritaires en semaine."
                }
            },
            {
                "question": {
                    "en": "Is there a campus cafeteria, and what are its hours?",
                    "fr": "Y a-t-il une cafétéria sur le campus, et quels sont ses horaires ?"
                },
                "reponse": {
                    "en": "The main cafeteria operates 7:00-20:00 weekdays and 8:00-14:00 weekends. Menu, pricing, and satellite café locations at https://www.iset-sfax.tn/facilities/dining.",
                    "fr": "La cafétéria principale est ouverte de 7h00 à 20h00 en semaine et de 8h00 à 14h00 le week-end. Menus, prix, et localisations des cafés satellites sur https://www.iset-sfax.tn/facilities/dining."
                }
            },
            {
                "question": {
                    "en": "Where can I print large-format posters for presentations?",
                    "fr": "Où puis-je imprimer des affiches grand format pour des présentations ?"
                },
                "reponse": {
                    "en": "The Print Center in Building E handles specialty printing including large-format posters and projects. Pricing and submission guidelines at https://www.iset-sfax.tn/facilities/print-center.",
                    "fr": "Le Centre d'impression du bâtiment E s'occupe de l'impression spécialisée, y compris des affiches grand format et des projets. Tarifs et instructions de soumission sur https://www.iset-sfax.tn/facilities/print-center."
                }
            },
            {
                "question": {
                    "en": "Are there bike rental or sharing services on campus?",
                    "fr": "Y a-t-il un service de location ou de partage de vélos sur le campus ?"
                },
                "reponse": {
                    "en": "The campus bike-sharing program offers 50 bicycles at 5 stations. Registration and usage fees at https://www.iset-sfax.tn/facilities/bike-sharing.",
                    "fr": "Le programme de partage de vélos du campus propose 50 vélos répartis sur 5 stations. Inscriptions et frais d'utilisation sur https://www.iset-sfax.tn/facilities/bike-sharing."
                }
            },
            {
                "question": {
                    "en": "Where can I find the lab safety guidelines?",
                    "fr": "Où puis-je trouver les consignes de sécurité en laboratoire ?"
                },
                "reponse": {
                    "en": "Laboratory safety manuals are available online at https://www.iset-sfax.tn/facilities/lab-safety. All students must complete safety training before accessing labs. Download the PDF or request a printed copy at the lab administration office.",
                    "fr": "Les manuels de sécurité des laboratoires sont disponibles en ligne sur https://www.iset-sfax.tn/facilities/lab-safety. Tous les étudiants doivent suivre une formation de sécurité avant d'accéder aux laboratoires. Téléchargez le PDF ou demandez une copie imprimée à l'administration des laboratoires."
                }
            },
            {
                "question": {
                    "en": "What are the library's weekend hours?",
                    "fr": "Quels sont les horaires de la bibliothèque le week-end ?"
                },
                "reponse": {
                    "en": "The library operates from 9:00-20:00 on Saturdays and 9:00-16:00 on Sundays during regular semesters. Holiday and exam period schedules at https://www.iset-sfax.tn/facilities/library-hours.",
                    "fr": "La bibliothèque est ouverte de 9h00 à 20h00 le samedi et de 9h00 à 16h00 le dimanche pendant les semestres réguliers. Horaires pendant les vacances et les périodes d'examen sur https://www.iset-sfax.tn/facilities/library-hours."
                }
            },
            {
                "question": {
                    "en": "Where is the campus bookstore located?",
                    "fr": "Où se trouve la librairie du campus ?"
                },
                "reponse": {
                    "en": "The campus bookstore is in Building A, Room 102. Hours: 8:30-16:30 Monday-Friday. Textbooks, supplies, and ISET merchandise available. Online ordering at https://www.iset-sfax.tn/facilities/bookstore.",
                    "fr": "La librairie du campus est située dans le bâtiment A, salle 102. Horaires : 8h30-16h30 du lundi au vendredi. Manuels, fournitures et produits dérivés ISET disponibles. Commandes en ligne sur https://www.iset-sfax.tn/facilities/bookstore."
                }
            },
            {
                "question": {
                    "en": "What are the cafeteria's payment options?",
                    "fr": "Quelles sont les options de paiement à la cafétéria ?"
                },
                "reponse": {
                    "en": "The cafeteria accepts cash, credit cards, and meal plan cards. Discounted meal plans can be purchased at https://www.iset-sfax.tn/facilities/meal-plans. Weekly menus posted online every Sunday.",
                    "fr": "La cafétéria accepte les paiements en espèces, par carte de crédit, et par carte de plan de repas. Des plans de repas à prix réduits peuvent être achetés sur https://www.iset-sfax.tn/facilities/meal-plans. Menus hebdomadaires publiés en ligne chaque dimanche."
                }
            },
              {
                    "question": {
                        "fr": "Comment puis-je payer mes frais de scolarité ?",
                        "en": "How do I pay my tuition?"
                    },
                    "reponse": {
                        "fr": "Les frais de scolarité peuvent être payés en ligne via le portail étudiant, en personne au Bureau du Trésorier, ou par virement bancaire. Des plans de paiement sont disponibles, permettant de payer les frais en versements échelonnés tout au long du semestre. Le Bureau d'Aide Financière peut fournir des informations sur les bourses et les options d'assistance au paiement.",
                        "en": "Tuition can be paid online through the student portal, in person at the Bursar's Office, or via bank transfer. Payment plans are available, allowing fees to be paid in installments throughout the semester. The Financial Aid Office can provide information about scholarships and payment assistance options."
                    }
                },
                {
                    "question": {
                        "fr": "Quelles bourses sont disponibles ?",
                        "en": "What scholarships are available?"
                    },
                    "reponse": {
                        "fr": "L'ISET Sfax offre des bourses au mérite, une aide financière basée sur les besoins, et des bourses spécifiques aux programmes. Les bourses au mérite reconnaissent la réussite académique, tandis que l'aide basée sur les besoins prend en compte les circonstances financières. Certains départements offrent également des bourses spécifiques à la discipline. Le Bureau d'Aide Financière peut fournir des informations détaillées sur les conditions d'éligibilité et les procédures de candidature.",
                        "en": "ISET Sfax offers merit-based scholarships, need-based financial aid, and program-specific scholarships. Merit scholarships recognize academic achievement, while need-based aid considers financial circumstances. Some departments also offer discipline-specific scholarships. The Financial Aid Office can provide detailed information about eligibility requirements and application procedures."
                    }
                },
               {
                "question": {
                    "fr": "Quels services de santé mentale sont offerts ?",
                    "en": "What mental health services are offered?"
                },
                "reponse": {
                    "fr": "L'ISET Sfax fournit des services confidentiels de santé mentale par l'intermédiaire du Centre de Bien-être Étudiant. Les services comprennent des conseils individuels, des séances de thérapie de groupe, des ateliers de gestion du stress et des interventions de crise. Ces services sont gratuits pour les étudiants inscrits. Le centre offre également des références vers des ressources communautaires lorsque nécessaire.",
                    "en": "ISET Sfax provides confidential mental health services through the Student Wellness Center. Services include individual counseling, group therapy sessions, stress management workshops, and crisis intervention. These services are free for enrolled students. The center also offers referrals to community resources when needed."
                }
            },
              {
            "question": {
                "fr": "Comment me désinscrire du partage des informations de l'annuaire ?",
                "en": "How do I opt out of directory information sharing?"
            },
            "reponse": {
                "fr": "Les préférences de partage des informations de l'annuaire sont gérées dans la section 'Paramètres de confidentialité'. Explication des droits FERPA et options sur https://www.iset-sfax.tn/student-portal/privacy.",
                "en": "Directory information sharing preferences are managed in the 'Privacy Settings' section. FERPA rights explanation and options at https://www.iset-sfax.tn/student-portal/privacy."
            }
        },
        {
            "question": {
                "fr": "Comment accéder au portail extranet ?",
                "en": "How to access the extranet portal?"
            },
            "reponse": {
                "fr": "Le portail de l'extranet est accessible via la sous-adresse extranet.isetsf.rnu.tn pour les étudiants et le personnel.",
                "en": "The extranet portal is accessible via the sub-address extranet.isetsf.rnu.tn for students and staff."
            }
        },
        {
            "question": {
                "fr": "Que permet le portail extranet ?",
                "en": "What does the extranet portal allow?"
            },
            "reponse": {
                "fr": "Il permet d'accéder aux notes, aux emplois du temps, et à d'autres informations personnelles.",
                "en": "It allows access to grades, schedules, and other personal information."
            }
        },
        {
            "question": {
                "fr": "Comment récupérer votre mot de passe pour l'extranet ?",
                "en": "How to recover your password for the extranet?"
            },
            "reponse": {
                "fr": "Un lien de réinitialisation du mot de passe est disponible sur la page de connexion de l'extranet.",
                "en": "A password reset link is available on the extranet login page."
            }
        },
        {
            "question": {
                "fr": "Où puis-je consulter mes résultats académiques ?",
                "en": "Where can I view my academic results?"
            },
            "reponse": {
                "fr": "Les résultats sont publiés sur le portail extranet accessible après authentification.",
                "en": "Results are published on the extranet portal accessible after authentication."
            }
        },
        {
            "question": {
                "fr": "Comment mettre à jour mes informations personnelles sur l'extranet ?",
                "en": "How to update my personal information on the extranet?"
            },
            "reponse": {
                "fr": "Les étudiants peuvent mettre à jour leurs informations via la section 'Profil' du portail.",
                "en": "Students can update their information via the 'Profile' section of the portal."
            }
        },
        {
            "question": {
                "fr": "Qui contacter en cas de problème avec l'extranet ?",
                "en": "Who to contact in case of a problem with the extranet?"
            },
            "reponse": {
                "fr": "Le support technique est disponible via un formulaire de contact dédié sur le portail.",
                "en": "Technical support is available via a dedicated contact form on the portal."
            }
        },
        {
            "question": {
                "fr": "L'extranet est-il accessible depuis l'extérieur du campus ?",
                "en": "Is the extranet accessible outside the campus?"
            },
            "reponse": {
                "fr": "Oui, l'accès à l'extranet est sécurisé et disponible depuis n'importe quel endroit.",
                "en": "Yes, access to the extranet is secure and available from any location."
            }
        },
        {
            "question": {
                "fr": "Comment accéder aux ressources pédagogiques via l'extranet ?",
                "en": "How to access educational resources via the extranet?"
            },
            "reponse": {
                "fr": "Les ressources pédagogiques et les documents de cours sont accessibles une fois connecté.",
                "en": "Educational resources and course documents are accessible once connected."
            }
        },
        {
            "question": {
                "fr": "Quels navigateurs supportent le portail extranet ?",
                "en": "Which browsers support the extranet portal?"
            },
            "reponse": {
                "fr": "Les navigateurs récents tels que Chrome, Firefox, et Edge sont recommandés pour un accès optimal.",
                "en": "Recent browsers such as Chrome, Firefox, and Edge are recommended for optimal access."
            }
        },
        {
            "question": {
                "fr": "Existe-t-il une application mobile pour l'extranet ?",
                "en": "Is there a mobile application for the extranet?"
            },
            "reponse": {
                "fr": "Pour l'instant, l'accès se fait principalement via le site web; une application mobile n'est pas encore disponible.",
                "en": "For the moment, access is mainly via the website; a mobile application is not yet available."
            }
        },
            {
            "question": {
                "fr": "Quel est le code de l'application mobile pour activer le portail ?",
                "en": "What is the mobile app code for portal activation?"
            },
            "reponse": {
                "fr": "Le code d'activation de l'application mobile est fourni lors de l'orientation. Si vous avez besoin d'un nouveau code, générez-en un sur https://www.iset-sfax.tn/student-portal/app-activation ou contactez helpdesk@iset-sfax.tn.",
                "en": "The mobile app activation code is provided during orientation. If you need a new code, generate one at https://www.iset-sfax.tn/student-portal/app-activation or contact helpdesk@iset-sfax.tn."
            }
        },
        {
            "question": {
                "fr": "Comment consulter mon rapport de progression académique ?",
                "en": "How do I view my academic progress report?"
            },
            "reponse": {
                "fr": "Les rapports de progression académique sont disponibles dans la section 'Dossiers académiques' du portail. Guide d'interprétation et options de contact avec l'advisor sur https://www.iset-sfax.tn/student-portal/progress-reports.",
                "en": "Academic progress reports are available in the 'Academic Records' section of the portal. Interpretation guide and advisor contact options at https://www.iset-sfax.tn/student-portal/progress-reports."
            }
        },
        {
            "question": {
                "fr": "Quels modes de paiement puis-je utiliser via le portail ?",
                "en": "What payment methods can I use through the portal?"
            },
            "reponse": {
                "fr": "Les paiements en ligne peuvent être effectués par carte de crédit, carte de débit ou virement bancaire électronique. Les protocoles de sécurité et les délais de traitement sont détaillés sur https://www.iset-sfax.tn/student-portal/payment-methods.",
                "en": "Online payments can be made via credit card, debit card, or electronic bank transfer. Security protocols and processing times detailed at https://www.iset-sfax.tn/student-portal/payment-methods."
            }
        },
        {
            "question": {
                "fr": "Comment m'inscrire pour recevoir des alertes par message texte ?",
                "en": "How do I register for text message alerts?"
            },
            "reponse": {
                "fr": "L'inscription aux alertes par message texte se gère dans la section 'Préférences de communication'. Ajoutez votre numéro de mobile et sélectionnez les types de notifications sur https://www.iset-sfax.tn/student-portal/alerts.",
                "en": "Text message alert registration is managed in the 'Communication Preferences' section. Add your mobile number and select notification types at https://www.iset-sfax.tn/student-portal/alerts."
            }
        },
        {
            "question": {
                "fr": "Quel est le processus pour signaler des problèmes techniques avec le portail ?",
                "en": "What is the process for reporting technical issues with the portal?"
            },
            "reponse": {
                "fr": "Les problèmes techniques liés au portail doivent être signalés à portal-help@iset-sfax.tn ou via le système de tickets d'aide sur https://www.iset-sfax.tn/student-portal/support.",
                "en": "Portal technical issues should be reported to portal-help@iset-sfax.tn or through the help ticket system at https://www.iset-sfax.tn/student-portal/support."
            }
        },
          {
              "question": {
                  "fr": "Comment accéder aux ressources de la bibliothèque à distance ?",
                  "en": "How do I access electronic library resources remotely?"
              },
              "reponse": {
                  "fr": "L'accès aux ressources électroniques de la bibliothèque nécessite une authentification via le portail. Instructions de connexion et dépannage sur https://www.iset-sfax.tn/student-portal/library-access.",
                  "en": "Remote library resource access requires portal authentication. Connection instructions and troubleshooting at https://www.iset-sfax.tn/student-portal/library-access."
              }
          },
          {
              "question": {
                  "fr": "Quelles informations les parents peuvent-ils consulter dans le portail ?",
                  "en": "What information can parents access in the portal?"
              },
              "reponse": {
                  "fr": "L'accès au portail parental est accordé uniquement avec l'autorisation de l'étudiant. Paramètres de permission et informations consultables sur https://www.iset-sfax.tn/student-portal/parent-access.",
                  "en": "Parent portal access is granted only with student authorization. Permission settings and viewable information at https://www.iset-sfax.tn/student-portal/parent-access."
              }
          },
          {
              "question": {
                  "fr": "Comment consulter et accepter les aides financières ?",
                  "en": "How do I view and accept financial aid awards?"
              },
              "reponse": {
                  "fr": "Les aides financières sont consultées et acceptées dans la section 'Aide financière'. Instructions pour examiner les termes et conditions sur https://www.iset-sfax.tn/student-portal/aid-acceptance.",
                  "en": "Financial aid awards are reviewed and accepted in the 'Financial Aid' section. Instructions for reviewing terms and conditions at https://www.iset-sfax.tn/student-portal/aid-acceptance."
              }
          },
                  {
            "question": {
                "fr": "Comment consulter mon affectation de logement et les informations sur mon colocataire ?",
                "en": "How do I view my housing assignment and roommate information?"
            },
            "reponse": {
                "fr": "Les affectations de logement et les informations de contact des colocataires sont disponibles dans la section 'Logement'. Les demandes de changement de chambre et les paramètres de préférence sont sur https://www.iset-sfax.tn/student-portal/housing.",
                "en": "Housing assignments and roommate contact information are available in the 'Housing' section. Room change requests and preference settings at https://www.iset-sfax.tn/student-portal/housing."
            }
        },
        {
            "question": {
                "fr": "Quelles options de gestion de plan de repas sont disponibles dans le portail ?",
                "en": "What meal plan management options are in the portal?"
            },
            "reponse": {
                "fr": "La sélection, les changements et le suivi du solde des plans de repas se gèrent dans la section 'Services Campus'. Instructions sur https://www.iset-sfax.tn/student-portal/meal-plans.",
                "en": "Meal plan selection, changes, and balance tracking are managed in the 'Campus Services' section. Instructions at https://www.iset-sfax.tn/student-portal/meal-plans."
            }
        },
        {
            "question": {
                "fr": "Comment enregistrer mon véhicule dans le portail étudiant ?",
                "en": "How do I register my vehicle in the student portal?"
            },
            "reponse": {
                "fr": "L'enregistrement des véhicules pour les permis de stationnement se fait dans la section 'Services Campus'. Les informations requises et les règlements sont sur https://www.iset-sfax.tn/student-portal/vehicle-registration.",
                "en": "Vehicle registration for parking permits is completed in the 'Campus Services' section. Required information and regulations at https://www.iset-sfax.tn/student-portal/vehicle-registration."
            }
        },
        {
            "question": {
                "fr": "Quels formulaires de santé doivent être soumis via le portail ?",
                "en": "What health forms must be submitted through the portal?"
            },
            "reponse": {
                "fr": "Les formulaires de santé requis comprennent les dossiers de vaccination et les informations sur l'assurance santé. Les directives de soumission et les délais sont sur https://www.iset-sfax.tn/student-portal/health-forms.",
                "en": "Required health forms include immunization records and health insurance information. Submission guidelines and deadlines at https://www.iset-sfax.tn/student-portal/health-forms."
            }
        },
        {
            "question": {
                "fr": "Comment accéder aux évaluations de cours à la fin du semestre ?",
                "en": "How do I access course evaluations at the end of the semester?"
            },
            "reponse": {
                "fr": "Les évaluations de cours sont disponibles dans la section 'Académique' pendant les deux dernières semaines de chaque semestre. Instructions de complétion sur https://www.iset-sfax.tn/student-portal/evaluations.",
                "en": "Course evaluations are available in the 'Academics' section during the last two weeks of each semester. Completion instructions at https://www.iset-sfax.tn/student-portal/evaluations."
            }
        },
        {
            "question": {
                "fr": "Quelles informations sont incluses dans mon profil du portail étudiant ?",
                "en": "What information is included in my student portal profile?"
            },
            "reponse": {
                "fr": "Les profils du portail étudiant incluent les informations de contact, les contacts d'urgence, les paramètres de confidentialité et les préférences de communication. Les instructions de mise à jour sont sur https://www.iset-sfax.tn/student-portal/profile-management.",
                "en": "Student portal profiles include contact information, emergency contacts, privacy settings, and communication preferences. Update guidelines at https://www.iset-sfax.tn/student-portal/profile-management."
            }
        },
        {
            "question": {
                "fr": "Comment postuler à la remise des diplômes via le portail ?",
                "en": "How do I apply for graduation through the portal?"
            },
            "reponse": {
                "fr": "Les demandes de remise des diplômes sont soumises dans la section 'Diplômation' après avoir complété au moins 75% des exigences de diplôme. Processus et liste de vérification sur https://www.iset-sfax.tn/student-portal/graduation-application.",
                "en": "Graduation applications are submitted through the 'Graduation' section after completing at least 75% of degree requirements. Process and checklist at https://www.iset-sfax.tn/student-portal/graduation-application."
            }
        },
        {
            "question": {
                "fr": "Quel est le processus pour configurer un dépôt direct pour les remboursements ?",
                "en": "What is the process for setting up direct deposit for refunds?"
            },
            "reponse": {
                "fr": "La configuration du dépôt direct pour les remboursements se gère dans la section 'Financier'. Les protocoles de sécurité des informations bancaires sont expliqués sur https://www.iset-sfax.tn/student-portal/direct-deposit.",
                "en": "Direct deposit setup for refunds is managed in the 'Financial' section. Banking information security protocols explained at https://www.iset-sfax.tn/student-portal/direct-deposit."
            }
        },
        {
            "question": {
                "fr": "Comment consulter mon audit de diplôme dans le portail ?",
                "en": "How do I view my degree audit in the portal?"
            },
            "reponse": {
                "fr": "Les audits de diplôme montrant l'avancement des exigences de graduation sont disponibles dans la section 'Dossiers académiques'. Guide d'interprétation sur https://www.iset-sfax.tn/student-portal/degree-audit.",
                "en": "Degree audits showing graduation requirement progress are available in the 'Academic Records' section. Interpretation guide at https://www.iset-sfax.tn/student-portal/degree-audit."
            }
        },
        {
            "question": {
                "fr": "Quels outils d'évaluation de carrière sont disponibles dans le portail ?",
                "en": "What career assessment tools are available in the portal?"
            },
            "reponse": {
                "fr": "Les outils d'évaluation de carrière, y compris les inventaires d'intérêts et les évaluations de compétences, sont accessibles via la section 'Carrière'. Guide d'interprétation des résultats sur https://www.iset-sfax.tn/student-portal/career-assessments.",
                "en": "Career assessment tools including interest inventories and skills assessments are accessed through the 'Career' section. Results interpretation guide at https://www.iset-sfax.tn/student-portal/career-assessments."
            }
        },
          {
              "question": {
                  "fr": "Quels horaires d'examen sont disponibles dans le portail ?",
                  "en": "What exam schedules are available in the portal?"
              },
              "reponse": {
                  "fr": "Les horaires d'examen sont publiés dans la section 'Calendrier académique'. La vue personnalisée affiche uniquement les examens pour les cours auxquels vous êtes inscrit. Guide de configuration sur https://www.iset-sfax.tn/student-portal/exam-schedule.",
                  "en": "Exam schedules are published in the 'Academic Calendar' section. Personalized view shows only exams for enrolled courses. Setup guide at https://www.iset-sfax.tn/student-portal/exam-schedule."
              }
          },
              {
                  "question": {
                      "fr": "Comment réinitialiser mon mot de passe du portail étudiant ?",
                      "en": "How do I reset my student portal password?"
                  },
                  "reponse": {
                      "fr": "Réinitialisez votre mot de passe sur https://www.iset-sfax.tn/portail-etudiant/reinitialisation-mot-de-passe. En cas de problème, contactez helpdesk@isetsf.rnu.tn avec votre identifiant étudiant.",
                      "en": "Reset your password at https://www.iset-sfax.tn/portail-etudiant/reinitialisation-mot-de-passe. If issues persist, contact helpdesk@isetsf.rnu.tn with your student ID."
                  }
              },
              {
                  "question": {
                      "fr": "Où puis-je consulter mes relevés de notes en ligne ?",
                      "en": "Where can I access my grade transcripts online?"
                  },
                  "reponse": {
                      "fr": "Les relevés de notes officiels sont disponibles dans la section 'Dossiers académiques' du portail étudiant. Pour obtenir des copies certifiées, faites une demande sur https://www.iset-sfax.tn/portail-etudiant/releves-notes.",
                      "en": "Official transcripts are available under 'Academic Records' in the student portal. For certified copies, apply at https://www.iset-sfax.tn/portail-etudiant/releves-notes."
                  }
              },
              {
                  "question": {
                      "fr": "Puis-je mettre à jour mes coordonnées via le portail étudiant ?",
                      "en": "Can I update my contact information through the student portal?"
                  },
                  "reponse": {
                      "fr": "Mettez à jour vos informations personnelles dans la section 'Profil' du portail. Toute modification des documents officiels nécessite une vérification en présentiel au bureau du registre.",
                      "en": "Update personal information through the 'Profile' section of your portal. Changes to official documents require in-person verification at the Registrar's Office."
                  }
              },
              {
                  "question": {
                      "fr": "Comment soumettre des devoirs via le portail étudiant ?",
                      "en": "How do I submit assignments through the student portal?"
                  },
                  "reponse": {
                      "fr": "La soumission des devoirs se fait via l’onglet 'Travaux de cours'. Les formats acceptés et les tailles maximales sont décrits sur https://www.iset-sfax.tn/student-portal/assignments. Conservez les confirmations de soumission.",
                      "en": "Assignment submission is through the 'Coursework' tab. Accepted formats and size limits described at https://www.iset-sfax.tn/student-portal/assignments. Keep submission confirmations."
                  }
              },
              {
                  "question": {
                      "fr": "Puis-je télécharger les supports de cours pour un accès hors ligne ?",
                      "en": "Can I download course materials for offline access?"
                  },
                  "reponse": {
                      "fr": "L'accès hors ligne aux supports de cours est disponible via l'application mobile. Instructions de téléchargement sur https://www.iset-sfax.tn/student-portal/offline-access.",
                      "en": "Offline access to course materials is available through the mobile app. Download instructions at https://www.iset-sfax.tn/student-portal/offline-access."
                  }
              },
              {
                  "question": {
                      "fr": "Quand les notes finales sont-elles publiées sur le portail ?",
                      "en": "When are final grades posted to the student portal?"
                  },
                  "reponse": {
                      "fr": "Les notes finales sont disponibles dans les 10 jours suivant la fin de la période d'examen. Activez les alertes de notification dans votre profil pour être informé immédiatement.",
                      "en": "Final grades appear within 10 days after the exam period ends. Enable grade notification alerts in your profile settings for immediate updates."
                  }
              },
              {
                  "question": {
                      "fr": "Comment activer les notifications pour les échéances de devoirs ?",
                      "en": "How do I set up notifications for assignment deadlines?"
                  },
                  "reponse": {
                      "fr": "Configurez les notifications d'échéance dans les paramètres du portail sous 'Alertes & Rappels'. Instructions sur https://www.iset-sfax.tn/student-portal/notifications.",
                      "en": "Configure deadline notifications in the Portal Settings under Alerts & Reminders. Instructions at https://www.iset-sfax.tn/student-portal/notifications."
                  }
              },
              {
                  "question": {
                      "fr": "Puis-je consulter mon emploi du temps sur mon téléphone ?",
                      "en": "Can I access my class schedule on my phone?"
                  },
                  "reponse": {
                      "fr": "L'accès mobile à l'emploi du temps est disponible via l'application ISET. Lien de téléchargement et instructions de synchronisation sur https://www.iset-sfax.tn/student-portal/mobile-access.",
                      "en": "Mobile schedule access is available through the ISET App. Download links and synchronization instructions at https://www.iset-sfax.tn/student-portal/mobile-access."
                  }
              },
              {
                  "question": {
                      "fr": "Comment rejoindre les classes virtuelles via le portail ?",
                      "en": "How do I join virtual classroom sessions through the portal?"
                  },
                  "reponse": {
                      "fr": "Les classes virtuelles sont accessibles via l'onglet 'Sessions en direct'. Exigences techniques et guide de dépannage sur https://www.iset-sfax.tn/student-portal/virtual-classrooms.",
                      "en": "Virtual classrooms are accessed through the 'Live Sessions' tab. Technical requirements and troubleshooting guide at https://www.iset-sfax.tn/student-portal/virtual-classrooms."
                  }
              },
              {
                  "question": {
                      "fr": "Puis-je créer des groupes d'étude dans le portail étudiant ?",
                      "en": "Can I create study groups in the student portal?"
                  },
                  "reponse": {
                      "fr": "Des groupes d'étude virtuels peuvent être créés dans la section 'Collaboration'. Définissez les paramètres de confidentialité et invitez vos camarades. Instructions sur https://www.iset-sfax.tn/student-portal/study-groups.",
                      "en": "Virtual study groups can be created in the 'Collaboration' section. Set privacy settings and invite classmates. Instructions at https://www.iset-sfax.tn/student-portal/study-groups."
                  }
              },
              {
                  "question": {
                      "fr": "Comment demander une attestation d’inscription officielle ?",
                      "en": "How do I request an official enrollment verification letter?"
                  },
                  "reponse": {
                      "fr": "Les attestations d'inscription peuvent être demandées via la section 'Documents'. Le traitement prend 2 à 3 jours ouvrables. Vérification sur https://www.iset-sfax.tn/student-portal/verification-letters.",
                      "en": "Enrollment verification letters can be requested through the 'Documents' section. Processing takes 2-3 business days. Verification at https://www.iset-sfax.tn/student-portal/verification-letters."
                  }
              },
              {
                  "question": {
                      "fr": "Existe-t-il une application mobile pour le portail étudiant ?",
                      "en": "Is there a mobile app for the student portal?"
                  },
                  "reponse": {
                      "fr": "L'application mobile ISET permet d'accéder au portail : emploi du temps, notes, annonces. Téléchargement iOS/Android sur https://www.iset-sfax.tn/student-portal/mobile-app.",
                      "en": "The ISET Mobile App provides portal access including schedules, grades, and announcements. Download for iOS/Android at https://www.iset-sfax.tn/student-portal/mobile-app."
                  }
              },
              {
                  "question": {
                      "fr": "Comment accéder au portail étudiant en ligne ?",
                      "en": "How do I access the online student portal?"
                  },
                  "reponse": {
                      "fr": "Accédez au portail étudiant sur https://portal.iset-sfax.tn avec votre identifiant et mot de passe. Les nouveaux utilisateurs doivent suivre la procédure d'activation sur https://www.iset-sfax.tn/student-portal/activation.",
                      "en": "Access the student portal at https://portal.iset-sfax.tn using your student ID and password. First-time users should follow the activation process described at https://www.iset-sfax.tn/student-portal/activation."
                  }
              },
              {
                  "question": {
                      "fr": "Où puis-je mettre à jour mon profil sur le portail étudiant ?",
                      "en": "Where can I update my profile on the student portal?"
                  },
                  "reponse": {
                      "fr": "Les mises à jour du profil se font dans la section 'Mon Profil'. Le téléversement de photo et la mise à jour des contacts d'urgence nécessitent une vérification. Instructions sur https://www.iset-sfax.tn/student-portal/profile.",
                      "en": "Profile updates can be made through the 'My Profile' section of the portal. Photo uploads and emergency contact changes require verification. Instructions at https://www.iset-sfax.tn/student-portal/profile."
                  }
              },
                {
                    "question": {
                        "fr": "Y a-t-il des logements disponibles sur le campus ?",
                        "en": "Is there housing available on campus?"
                    },
                    "reponse": {
                        "fr": "Oui, l'ISET Sfax propose des options de logement sur le campus dans plusieurs résidences. Les hébergements comprennent des chambres simples, doubles et de style suite avec des espaces communs partagés. Les demandes de logement doivent être soumises tôt car l'espace est limité. Le Bureau du Logement peut fournir des informations sur les coûts, les commodités et les procédures de demande.",
                        "en": "Yes, ISET Sfax offers on-campus housing options in several residence halls. Accommodations include single, double, and suite-style rooms with shared common areas. Housing applications should be submitted early as space is limited. The Housing Office can provide information about costs, amenities, and application procedures."
                    }
                },
                {
                    "question": {
                        "fr": "Quels services sont offerts aux étudiants ?",
                        "en": "What services are offered to students?"
                    },
                    "reponse": {
                        "fr": {
                            "orientation": {
                                "description": "Service d'orientation et d'accompagnement des étudiants",
                                "activites": [
                                    "Ateliers de méthodologie",
                                    "Sessions d'orientation professionnelle",
                                    "Accompagnement personnalisé"
                                ]
                            },
                            "bureau_des_stages": {
                                "services": [
                                    "Aide à la recherche de stage",
                                    "Préparation aux entretiens",
                                    "Suivi des stages",
                                    "Base de données d'entreprises partenaires"
                                ],
                                "contact": "bureau.stages@isetsf.rnu.tn"
                            },
                            "vie_etudiante": {
                                "clubs": [
                                    "Club informatique",
                                    "Club robotique",
                                    "Club développement web",
                                    "Club sécurité informatique"
                                ],
                                "evenements": [
                                    "Hackathons",
                                    "Conférences techniques",
                                    "Visites d'entreprises",
                                    "Journées portes ouvertes"
                                ]
                            },
                            "soutien": {
                                "psychologique": "Service de soutien psychologique disponible",
                                "academique": "Tutorat par les étudiants avancés",
                                "handicap": "Aménagements pour étudiants en situation de handicap"
                            }
                        },
                        "en": {
                            "orientation": {
                                "description": "Student orientation and support service",
                                "activities": [
                                    "Methodology workshops",
                                    "Professional orientation sessions",
                                    "Personalized support"
                                ]
                            },
                            "internship_office": {
                                "services": [
                                    "Internship search assistance",
                                    "Interview preparation",
                                    "Internship follow-up",
                                    "Partner companies database"
                                ],
                                "contact": "bureau.stages@isetsf.rnu.tn"
                            },
                            "student_life": {
                                "clubs": [
                                    "Computer club",
                                    "Robotics club",
                                    "Web development club",
                                    "Computer security club"
                                ],
                                "events": [
                                    "Hackathons",
                                    "Technical conferences",
                                    "Company visits",
                                    "Open house days"
                                ]
                            },
                            "support": {
                                "psychological": "Psychological support service available",
                                "academic": "Tutoring by advanced students",
                                "disability": "Accommodations for students with disabilities"
                            }
                        }
                    }
                }
            ]
        },
        "partenariats": {
            "titre": {
                "fr": "Partenariats et Collaborations",
                "en": "Partnerships and Collaborations"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quels sont les principaux partenariats du département des Technologies de l'Informatique ?",
                        "en": "What are the main partnerships of the Computer Technologies department?"
                    },
                    "reponse": {
                        "fr": {
                            "entreprises": [
                                {
                                    "nom": "Sofrecom Tunisie",
                                    "type": "Partenariat de formation",
                                    "activites": [
                                        "Stages étudiants",
                                        "Projets de fin d'études",
                                        "Formation continue"
                                    ]
                                },
                                {
                                    "nom": "IBM Tunisie",
                                    "type": "Partenariat académique",
                                    "activites": [
                                        "Accès aux technologies IBM",
                                        "Certifications",
                                        "Workshops techniques"
                                    ]
                                }
                            ],
                            "universites": [
                                {
                                    "nom": "Université de Sfax",
                                    "type": "Collaboration académique",
                                    "activites": [
                                        "Échanges d'enseignants",
                                        "Projets de recherche communs",
                                        "Accès aux ressources"
                                    ]
                                }
                            ],
                            "certifications": [
                                {
                                    "nom": "Cisco Networking Academy",
                                    "description": "Programme de certification en réseaux",
                                    "niveaux": ["CCNA", "CCNP"]
                                },
                                {
                                    "nom": "Microsoft Imagine Academy",
                                    "description": "Programme de certification Microsoft",
                                    "niveaux": ["MTA", "MCSA"]
                                }
                            ]
                        },
                        "en": {
                            "companies": [
                                {
                                    "name": "Sofrecom Tunisia",
                                    "type": "Training partnership",
                                    "activities": [
                                        "Student internships",
                                        "Final year projects",
                                        "Continuing education"
                                    ]
                                },
                                {
                                    "name": "IBM Tunisia",
                                    "type": "Academic partnership",
                                    "activities": [
                                        "Access to IBM technologies",
                                        "Certifications",
                                        "Technical workshops"
                                    ]
                                }
                            ],
                            "universities": [
                                {
                                    "name": "University of Sfax",
                                    "type": "Academic collaboration",
                                    "activities": [
                                        "Faculty exchange",
                                        "Joint research projects",
                                        "Resource sharing"
                                    ]
                                }
                            ],
                            "certifications": [
                                {
                                    "name": "Cisco Networking Academy",
                                    "description": "Networking certification program",
                                    "levels": ["CCNA", "CCNP"]
                                },
                                {
                                    "name": "Microsoft Imagine Academy",
                                    "description": "Microsoft certification program",
                                    "levels": ["MTA", "MCSA"]
                                }
                            ]
                        }
                    }
                }
            ]
        },
        "matieres_enseignees": {
            "titre": {
                "fr": "Matières et Programmes d'Études",
                "en": "Courses and Study Programs"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quelles sont les matières enseignées en Licence Développement des Systèmes Informatiques (DSI) ?",
                        "en": "What courses are taught in the Information Systems Development (DSI) Bachelor's program?"
                    },
                    "reponse": {
                        "fr": {
                            "semestre_1": {
                                "titre": "Semestre 1",
                                "modules": [
                                    {
                                        "nom": "Algorithmique et Structures de Données",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Introduction à la Programmation",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Architecture des Ordinateurs",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Systèmes d'Exploitation",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Mathématiques pour l'Informatique",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Transversal"
                                    },
                                    {
                                        "nom": "Anglais Technique",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Transversal"
                                    }
                                ]
                            },
                            "semestre_2": {
                                "titre": "Semestre 2",
                                "modules": [
                                    {
                                        "nom": "Programmation Orientée Objet",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Bases de Données",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Développement Web",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Réseaux Informatiques",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Techniques de Communication",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Transversal"
                                    }
                                ]
                            }
                        },
                        "en": {
                            "semester_1": {
                                "title": "Semester 1",
                                "modules": [
                                    {
                                        "name": "Algorithms and Data Structures",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Introduction to Programming",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Computer Architecture",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Operating Systems",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Mathematics for Computer Science",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Transversal"
                                    },
                                    {
                                        "name": "Technical English",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Transversal"
                                    }
                                ]
                            },
                            "semester_2": {
                                "title": "Semester 2",
                                "modules": [
                                    {
                                        "name": "Object-Oriented Programming",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Databases",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Web Development",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Computer Networks",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Communication Techniques",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Transversal"
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les matières enseignées en Licence Réseaux et Systèmes Informatiques (RSI) ?",
                        "en": "What courses are taught in the Networks and Information Systems (RSI) Bachelor's program?"
                    },
                    "reponse": {
                        "fr": {
                            "semestre_1": {
                                "titre": "Semestre 1",
                                "modules": [
                                    {
                                        "nom": "Fondamentaux des Réseaux",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Administration Système Linux",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Sécurité des Réseaux",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Virtualisation et Cloud",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Protocoles de Communication",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    }
                                ]
                            },
                            "semestre_2": {
                                "titre": "Semestre 2",
                                "modules": [
                                    {
                                        "nom": "Administration Windows Server",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Services Réseaux",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Technologies Cisco",
                                        "volume_horaire": 45,
                                        "credits": 3,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Supervision des Réseaux",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    },
                                    {
                                        "nom": "Scripting pour l'Administration",
                                        "volume_horaire": 30,
                                        "credits": 2,
                                        "type": "Fondamental"
                                    }
                                ]
                            }
                        },
                        "en": {
                            "semester_1": {
                                "title": "Semester 1",
                                "modules": [
                                    {
                                        "name": "Network Fundamentals",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Linux System Administration",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Network Security",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Virtualization and Cloud",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Communication Protocols",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    }
                                ]
                            },
                            "semester_2": {
                                "title": "Semester 2",
                                "modules": [
                                    {
                                        "name": "Windows Server Administration",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Network Services",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Cisco Technologies",
                                        "hours": 45,
                                        "credits": 3,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Network Monitoring",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    },
                                    {
                                        "name": "Administration Scripting",
                                        "hours": 30,
                                        "credits": 2,
                                        "type": "Core"
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les matières enseignées en Master DSIR (Développement des Systèmes d'Information et Réseaux) ?",
                        "en": "What courses are taught in the DSIR (Information Systems and Networks Development) Master's program?"
                    },
                    "reponse": {
                        "fr": {
                            "semestre_1": {
                                "titre": "Semestre 1",
                                "modules": [
                                    {
                                        "nom": "Algorithmique et optimisation",
                                        "volume_horaire": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Atelier Programmation avancée",
                                        "volume_horaire": 21,
                                        "credits": 2,
                                        "coefficient": 2,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Mini-projet 1",
                                        "volume_horaire": 21,
                                        "credits": 2,
                                        "coefficient": 2,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Infogérance et virtualisation",
                                        "volume_horaire": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Atelier Cloud Computing",
                                        "volume_horaire": 42,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Intelligence artificielle",
                                        "volume_horaire": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    }
                                ]
                            },
                            "semestre_2": {
                                "titre": "Semestre 2",
                                "modules": [
                                    {
                                        "nom": "Certification Machine Learning",
                                        "volume_horaire": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Atelier Système intelligent 2",
                                        "volume_horaire": 42,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    },
                                    {
                                        "nom": "Certification IOT",
                                        "volume_horaire": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixte"
                                    }
                                ]
                            },
                            "semestre_3": {
                                "titre": "Semestre 3",
                                "options": {
                                    "option1": {
                                        "nom": "Génie Logiciel et Nouvelles Technologies",
                                        "modules": [
                                            {
                                                "nom": "Qualité et performance logicielle",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Méthodes AGILE",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Atelier test et qualité logicielle",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    },
                                    "option2": {
                                        "nom": "Réseaux & IoT",
                                        "modules": [
                                            {
                                                "nom": "Réseaux de capteurs sans fil pour l'IOT",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Protocoles applicatifs pour l'IOT",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Anglais scientifique",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Technologie Blockchain",
                                                "volume_horaire": 42,
                                                "credits": 3,
                                                "coefficient": 3,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Simulateurs réseaux",
                                                "volume_horaire": 42,
                                                "credits": 3,
                                                "coefficient": 3,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    }
                                }
                            }
                        },
                        "en": {
                            "semester_1": {
                                "title": "Semester 1",
                                "modules": [
                                    {
                                        "name": "Algorithms and optimization",
                                        "hours": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "Advanced Programming Workshop",
                                        "hours": 21,
                                        "credits": 2,
                                        "coefficient": 2,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "Mini-project 1",
                                        "hours": 21,
                                        "credits": 2,
                                        "coefficient": 2,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "IT Management and Virtualization",
                                        "hours": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "Cloud Computing Workshop",
                                        "hours": 42,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "Artificial Intelligence",
                                        "hours": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    }
                                ]
                            },
                            "semester_2": {
                                "title": "Semester 2",
                                "modules": [
                                    {
                                        "name": "Machine Learning Certification",
                                        "hours": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "Intelligent System Workshop 2",
                                        "hours": 42,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    },
                                    {
                                        "name": "IOT Certification",
                                        "hours": 21,
                                        "credits": 3,
                                        "coefficient": 3,
                                        "regime": "Mixed"
                                    }
                                ]
                            },
                            "semester_3": {
                                "title": "Semester 3",
                                "options": {
                                    "option1": {
                                        "name": "Software Engineering and New Technologies",
                                        "modules": [
                                            {
                                                "name": "Software Quality and Performance",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "AGILE Methods",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Software Testing and Quality Workshop",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    },
                                    "option2": {
                                        "name": "Networks & IoT",
                                        "modules": [
                                            {
                                                "name": "Wireless Sensor Networks for IoT",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Application Protocols for IoT",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Scientific English",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Blockchain Technology",
                                                "hours": 42,
                                                "credits": 3,
                                                "coefficient": 3,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Network Simulators",
                                                "hours": 42,
                                                "credits": 3,
                                                "coefficient": 3,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    }
                                }
                            }
                        }
                    }
                },
                {
                    "question": {
                        "fr": "Quelles sont les matières enseignées en Licence Administration des Systèmes, Sécurité et Cloud Computing (ASSC) ?",
                        "en": "What courses are taught in the Systems Administration, Security and Cloud Computing (ASSC) Bachelor's program?"
                    },
                    "reponse": {
                        "fr": {
                            "semestre_1": {
                                "titre": "Semestre 1",
                                "modules": [
                                    {
                                        "nom": "Architecture et Services Réseaux",
                                        "sous_modules": [
                                            {
                                                "nom": "Architecture et protocoles réseaux",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 1,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Services réseaux",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 1,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    },
                                    {
                                        "nom": "Administration Systèmes Linux",
                                        "sous_modules": [
                                            {
                                                "nom": "Administration Linux",
                                                "volume_horaire": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Atelier Administration Linux",
                                                "volume_horaire": 42,
                                                "credits": 3,
                                                "coefficient": 1,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    },
                                    {
                                        "nom": "Administration Bases de Données",
                                        "sous_modules": [
                                            {
                                                "nom": "Sécurité et administration des BDD",
                                                "volume_horaire": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Atelier sécurité BDD",
                                                "volume_horaire": 21,
                                                "credits": 1.5,
                                                "coefficient": 1,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    }
                                ]
                            },
                            "semestre_2": {
                                "titre": "Semestre 2",
                                "modules": [
                                    {
                                        "nom": "Administration et Supervision des Réseaux",
                                        "sous_modules": [
                                            {
                                                "nom": "Administration & Supervision des réseaux",
                                                "volume_horaire": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Atelier Supervision des Réseaux",
                                                "volume_horaire": 21,
                                                "credits": 2,
                                                "coefficient": 1,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    },
                                    {
                                        "nom": "Administration Avancée Linux",
                                        "sous_modules": [
                                            {
                                                "nom": "Administration Avancée Linux",
                                                "volume_horaire": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixte"
                                            },
                                            {
                                                "nom": "Atelier Linux avancé",
                                                "volume_horaire": 42,
                                                "credits": 3,
                                                "coefficient": 1,
                                                "regime": "Mixte"
                                            }
                                        ]
                                    }
                                ]
                            }
                        },
                        "en": {
                            "semester_1": {
                                "title": "Semester 1",
                                "modules": [
                                    {
                                        "name": "Network Architecture and Services",
                                        "sub_modules": [
                                            {
                                                "name": "Network Architecture and Protocols",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 1,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Network Services",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 1,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    },
                                    {
                                        "name": "Linux Systems Administration",
                                        "sub_modules": [
                                            {
                                                "name": "Linux Administration",
                                                "hours": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Linux Administration Workshop",
                                                "hours": 42,
                                                "credits": 3,
                                                "coefficient": 1,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    },
                                    {
                                        "name": "Database Administration",
                                        "sub_modules": [
                                            {
                                                "name": "Database Security and Administration",
                                                "hours": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Database Security Workshop",
                                                "hours": 21,
                                                "credits": 1.5,
                                                "coefficient": 1,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    }
                                ]
                            },
                            "semester_2": {
                                "title": "Semester 2",
                                "modules": [
                                    {
                                        "name": "Network Administration and Supervision",
                                        "sub_modules": [
                                            {
                                                "name": "Network Administration & Supervision",
                                                "hours": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Network Supervision Workshop",
                                                "hours": 21,
                                                "credits": 2,
                                                "coefficient": 1,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    },
                                    {
                                        "name": "Advanced Linux Administration",
                                        "sub_modules": [
                                            {
                                                "name": "Advanced Linux Administration",
                                                "hours": 21,
                                                "credits": 3,
                                                "coefficient": 2,
                                                "regime": "Mixed"
                                            },
                                            {
                                                "name": "Advanced Linux Workshop",
                                                "hours": 42,
                                                "credits": 3,
                                                "coefficient": 1,
                                                "regime": "Mixed"
                                            }
                                        ]
                                    }
                                ]
                            }
                        }
                    }
                }
            ]
        },
        "library": {
            "titre": {
                "fr": "Bibliothèque",
                "en": "Library"
            },
            "questions": [
                {
                    "question": {
                        "fr": "Quels sont les horaires de la bibliothèque pendant la semaine des examens ?",
                        "en": "What are the library hours during exam week?"
                    },
                    "reponse": {
                        "fr": "Pendant les périodes d'examen, la bibliothèque est ouverte de 8h00 à 23h00 du lundi au vendredi et de 9h00 à 20h00 le week-end. Consultez https://www.iset-sfax.tn/bibliotheque pour les exceptions liées aux jours fériés.",
                        "en": "During exam periods, the library extends hours to 8:00-23:00 Monday-Friday and 9:00-20:00 on weekends. Check https://www.iset-sfax.tn/bibliotheque for holiday exceptions."
                    }
                },
                {
                    "question": {
                        "fr": "Comment réserver une salle d'étude à la bibliothèque ?",
                        "en": "How do I reserve a study room in the library?"
                    },
                    "reponse": {
                        "fr": "Les salles d'étude peuvent être réservées jusqu'à 2 semaines à l'avance via https://www.iset-sfax.tn/bibliotheque/reservation. Les réservations sont limitées à 3 heures par jour et par groupe d'étudiants.",
                        "en": "Study rooms can be booked up to 2 weeks in advance through https://www.iset-sfax.tn/bibliotheque/reservation. Reservations are limited to 3 hours per day per student group."
                    }
                },
                {
                    "question": {
                        "fr": "Comment accéder aux revues académiques et ressources numériques ?",
                        "en": "How do I access academic journals and resources?"
                    },
                    "reponse": {
                        "fr": "Les ressources numériques comprennent l'accès aux revues IEEE Xplore, ScienceDirect et Springer. Instructions d'accès à distance disponibles sur https://www.iset-sfax.tn/bibliotheque/ressources-electroniques.",
                        "en": "Digital library resources include access to IEEE Xplore, ScienceDirect, and Springer journals. Remote access instructions at https://www.iset-sfax.tn/bibliotheque/ressources-electroniques."
                    }
                },
                {
                    "question": {
                        "fr": "Quelle est la procédure pour demander un nouvel abonnement à une revue ?",
                        "en": "What is the process for requesting a new journal subscription?"
                    },
                    "reponse": {
                        "fr": "Les demandes d'abonnement à une revue peuvent être soumises via le portail de la bibliothèque. Le formulaire de demande et les critères d'évaluation sont disponibles sur https://www.iset-sfax.tn/bibliotheque/demande-abonnement.",
                        "en": "Journal subscription requests can be submitted through the library portal. The request form and evaluation criteria are available at https://www.iset-sfax.tn/bibliotheque/demande-abonnement."
                    }
                },
                {
                    "question": {
                        "fr": "Comment réserver une salle de réunion pour les projets de groupe ?",
                        "en": "How do I reserve a meeting room for group projects?"
                    },
                    "reponse": {
                        "fr": "Les salles de réunion pour projets de groupe peuvent être réservées jusqu'à 2 semaines à l'avance via le système de réservation en ligne. Politiques de réservation et capacités des salles disponibles sur https://www.iset-sfax.tn/bibliotheque/salles-reunion.",
                        "en": "Group meeting rooms can be booked up to 2 weeks in advance through the online reservation system. Booking policies and room capacities at https://www.iset-sfax.tn/bibliotheque/salles-reunion."
                    }
                },
                {
                    "question": {
                        "fr": "Comment accéder aux ressources de la bibliothèque ?",
                        "en": "How do I access the library resources?"
                    },
                    "reponse": {
                        "fr": "Vous pouvez accéder à la collection physique de la bibliothèque en la visitant pendant les heures d'ouverture avec votre carte d'étudiant. Les ressources numériques, y compris les livres électroniques, les revues et les bases de données, sont accessibles 24h/24 et 7j/7 via le portail en ligne de la bibliothèque. La bibliothèque offre également une assistance à la recherche, des services de prêt entre bibliothèques et des espaces d'étude.",
                        "en": "You can access the library's physical collection by visiting during operating hours with your student ID. Digital resources, including e-books, journals, and databases, are accessible 24/7 through the library's online portal. The library also offers research assistance, interlibrary loan services, and study spaces."
                    }
                }
            ]
        },
        "initiatives": {
                      "questions": [
                          {
                              "question": {
                                  "fr": "Quelles initiatives environnementales l'ISETSF promeut-elle ?",
                                  "en": "What environmental initiatives does ISET Sfax promote?"
                              },
                              "reponse": {
                                  "fr": "L'institution organise des actions et campagnes de sensibilisation à l'environnement pour les étudiants.",
                                  "en": "The institution organizes actions and awareness campaigns on environmental issues for students."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment participer aux projets de développement durable ?",
                                  "en": "How can I participate in sustainable development projects?"
                              },
                              "reponse": {
                                  "fr": "Les projets durables sont présentés sur le site et les étudiants peuvent y participer via des inscriptions spécifiques.",
                                  "en": "Sustainable projects are presented on the website, and students can participate by registering for specific projects."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Quels projets associatifs soutenus par l'ISETSF existent ?",
                                  "en": "What student association projects are supported by ISET Sfax?"
                              },
                              "reponse": {
                                  "fr": "Plusieurs projets associatifs sont soutenus, visant à développer l'engagement citoyen des étudiants.",
                                  "en": "Several student association projects are supported, aiming to develop the civic engagement of students."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment l'ISETSF intègre-t-il la responsabilité sociale dans ses programmes ?",
                                  "en": "How does ISET Sfax integrate social responsibility into its programs?"
                              },
                              "reponse": {
                                  "fr": "Des modules et ateliers sur la responsabilité sociale sont intégrés dans plusieurs cursus.",
                                  "en": "Modules and workshops on social responsibility are integrated into several programs."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Où trouver les actions sociales de l'ISETSF ?",
                                  "en": "Where can I find information about ISET Sfax's social actions?"
                              },
                              "reponse": {
                                  "fr": "La rubrique « Initiatives » du site détaille les actions sociales et environnementales menées par l'institution.",
                                  "en": "The 'Initiatives' section on the website details the social and environmental actions carried out by the institution."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Quels partenariats avec des ONG l'ISETSF a-t-il ?",
                                  "en": "What partnerships with NGOs does ISET Sfax have?"
                              },
                              "reponse": {
                                  "fr": "L'ISETSF collabore avec des ONG pour promouvoir des projets à impact social et environnemental.",
                                  "en": "ISET Sfax collaborates with NGOs to promote projects with social and environmental impact."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment l'ISETSF encourage-t-il l'engagement citoyen ?",
                                  "en": "How does ISET Sfax encourage civic engagement?"
                              },
                              "reponse": {
                                  "fr": "L'institution organise des forums et ateliers visant à sensibiliser les étudiants aux enjeux sociétaux.",
                                  "en": "The institution organizes forums and workshops to raise awareness among students about societal issues."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Quelles formations sur le développement durable sont proposées ?",
                                  "en": "What sustainable development training is offered?"
                              },
                              "reponse": {
                                  "fr": "Des formations spécifiques sur le développement durable et la gestion des ressources sont offertes.",
                                  "en": "Specific training on sustainable development and resource management is offered."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment participer aux campagnes de sensibilisation ?",
                                  "en": "How can I participate in awareness campaigns?"
                              },
                              "reponse": {
                                  "fr": "Les campagnes sont annoncées sur le site et les étudiants peuvent s'inscrire pour y participer activement.",
                                  "en": "Campaigns are announced on the website, and students can register to actively participate."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Quels projets collaboratifs avec la communauté locale sont en cours ?",
                                  "en": "What collaborative projects with the local community are ongoing?"
                              },
                              "reponse": {
                                  "fr": "L'ISETSF développe des projets collaboratifs avec des acteurs locaux pour favoriser l'insertion professionnelle.",
                                  "en": "ISET Sfax is developing collaborative projects with local actors to promote professional integration."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment l'ISETSF soutient-il l'innovation sociale ?",
                                  "en": "How does ISET Sfax support social innovation?"
                              },
                              "reponse": {
                                  "fr": "L'institution met en place des incubateurs et ateliers pour stimuler les projets d'innovation sociale.",
                                  "en": "The institution sets up incubators and workshops to stimulate social innovation projects."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment participer aux projets collaboratifs étudiants ?",
                                  "en": "How can I participate in student collaborative projects?"
                              },
                              "reponse": {
                                  "fr": "Les modalités de participation aux projets collaboratifs sont indiquées dans la rubrique Initiatives sur https://www.iset-sfax.tn/fr.",
                                  "en": "Participation details for collaborative projects are provided in the 'Initiatives' section on https://www.iset-sfax.tn/fr."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Quels projets d'innovation sociale sont soutenus ?",
                                  "en": "What social innovation projects are supported?"
                              },
                              "reponse": {
                                  "fr": "Les projets d'innovation sociale sont présentés dans la rubrique Initiatives sur https://www.iset-sfax.tn/fr.",
                                  "en": "Social innovation projects are presented in the 'Initiatives' section on https://www.iset-sfax.tn/fr."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Comment s'inscrire aux ateliers d'innovation sociale ?",
                                  "en": "How can I register for social innovation workshops?"
                              },
                              "reponse": {
                                  "fr": "Les inscriptions aux ateliers d'innovation sociale se font via le portail Initiatives sur https://www.iset-sfax.tn/fr.",
                                  "en": "Registration for social innovation workshops is done through the 'Initiatives' portal on https://www.iset-sfax.tn/fr."
                              }
                          },
                          {
                              "question": {
                                  "fr": "Quels services de mentorat pour projets associatifs sont proposés ?",
                                  "en": "What mentoring services for association projects are offered?"
                              },
                              "reponse": {
                                  "fr": "Les services de mentorat pour projets associatifs sont organisés via la rubrique Initiatives sur https://www.iset-sfax.tn/fr.",
                                  "en": "Mentoring services for association projects are organized through the 'Initiatives' section on https://www.iset-sfax.tn/fr."
                              }
                          }
                      ]
        },
        "research": {
            "questions": [
                {
                    "question": {
                        "fr": "Comment participer au groupe de recherche en interaction homme-machine ?",
                        "en": "How do I participate in the human-computer interaction research group?"
                    },
                    "reponse": {
                        "fr": "Le groupe de recherche HCI étudie la conception des interfaces utilisateur, l'accessibilité, et l'expérience utilisateur. Pour participer aux études et découvrir les opportunités de recherche, consultez https://www.iset-sfax.tn/recherche/hci-research.",
                        "en": "The HCI research group studies user interface design, accessibility, and user experience. Study participation and research opportunities at https://www.iset-sfax.tn/recherche/hci-research."
                    }
                },
                {
                    "question": {
                        "fr": "Quelle recherche est menée à ISETSF ?",
                        "en": "What research is conducted at ISETSF?"
                    },
                    "reponse": {
                        "fr": "L'institution mène des recherches appliquées dans divers domaines technologiques.",
                        "en": "The institution conducts applied research in various technological fields."
                    }
                },
                {
                    "question": {
                        "fr": "Quels laboratoires de recherche possède l'ISETSF ?",
                        "en": "What research laboratories does ISETSF have?"
                    },
                    "reponse": {
                        "fr": "L'ISETSF possède plusieurs laboratoires équipés pour la recherche en électronique, informatique et mécanique.",
                        "en": "ISETSF has several laboratories equipped for research in electronics, computer science, and mechanics."
                    }
                },
                {
                    "question": {
                        "fr": "Comment l'ISETSF soutient-il l'innovation ?",
                        "en": "How does ISETSF support innovation?"
                    },
                    "reponse": {
                        "fr": "Grâce à des projets collaboratifs et des partenariats industriels, l'ISETSF favorise l'innovation.",
                        "en": "Through collaborative projects and industrial partnerships, ISETSF promotes innovation."
                    }
                },
                {
                    "question": {
                        "fr": "Où trouver les publications scientifiques de l'ISETSF ?",
                        "en": "Where to find ISETSF scientific publications?"
                    },
                    "reponse": {
                        "fr": "Les publications et résultats de recherche sont disponibles dans la section 'Recherche' du site web.",
                        "en": "Publications and research results are available on the 'Research' section of the website."
                    }
                },
                {
                    "question": {
                        "fr": "Quels projets de recherche sont en cours ?",
                        "en": "What research projects are ongoing?"
                    },
                    "reponse": {
                        "fr": "Plusieurs projets sont en cours en partenariat avec des entreprises et des universités locales et internationales.",
                        "en": "Several projects in partnership with local and international companies and universities are ongoing."
                    }
                },
                {
                    "question": {
                        "fr": "Comment participer à un projet de recherche ?",
                        "en": "How to participate in a research project?"
                    },
                    "reponse": {
                        "fr": "Les étudiants et chercheurs intéressés peuvent contacter les responsables de laboratoire via le site web.",
                        "en": "Interested students and researchers can contact laboratory managers via the website."
                    }
                },
                {
                    "question": {
                        "fr": "Quel financement de recherche est disponible ?",
                        "en": "What research funding is available?"
                    },
                    "reponse": {
                        "fr": "L'ISETSF obtient des financements publics et privés pour soutenir ses projets de recherche.",
                        "en": "ISETSF obtains public and private funding to support its research projects."
                    }
                },
                {
                    "question": {
                        "fr": "Y a-t-il des séminaires de recherche à l'ISETSF ?",
                        "en": "Are there research seminars at ISETSF?"
                    },
                    "reponse": {
                        "fr": "Oui, l'institution organise régulièrement des séminaires et des colloques sur des thèmes technologiques.",
                        "en": "Yes, the institution regularly organizes seminars and colloquiums on technological themes."
                    }
                },
                {
                    "question": {
                        "fr": "Comment publier des recherches via l'ISETSF ?",
                        "en": "How to publish research via ISETSF?"
                    },
                    "reponse": {
                        "fr": "Les chercheurs peuvent soumettre leurs travaux à des revues partenaires ou via la plateforme interne de l'ISETSF.",
                        "en": "Researchers can submit their work to partner journals or via ISETSF's internal platform."
                    }
                },
                {
                    "question": {
                        "fr": "Où trouver les actualités de recherche ?",
                        "en": "Where to find research news?"
                    },
                    "reponse": {
                        "fr": "Les dernières actualités de recherche sont présentées sur la page dédiée aux actualités scientifiques.",
                        "en": "The latest research news is presented on the page dedicated to scientific news."
                    }
                },
                {
                    "question": {
                        "fr": "Quelles collaborations de recherche internationales existent ?",
                        "en": "What international research collaborations exist?"
                    },
                    "reponse": {
                        "fr": "L'ISETSF collabore avec plusieurs institutions internationales et centres de recherche.",
                        "en": "ISETSF collaborates with several international institutions and research centers."
                    }
                },
                {
                    "question": {
                        "fr": "Comment participer à des projets de recherche de premier cycle ?",
                        "en": "How do I participate in undergraduate research projects?"
                    },
                    "reponse": {
                        "fr": "Les étudiants de premier cycle peuvent postuler pour rejoindre des projets de recherche via le portail de recherche. Exigences et processus de candidature sur https://www.iset-sfax.tn/recherche/opportunites-etudiants.",
                        "en": "Undergraduate students can apply to join research projects through the research portal. Requirements and application process at https://www.iset-sfax.tn/recherche/opportunites-etudiants."
                    }
                },
                {
                    "question": {
                        "fr": "Quelle infrastructure de recherche est disponible à l'ISET Sfax ?",
                        "en": "What research infrastructure is available at ISET Sfax?"
                    },
                    "reponse": {
                        "fr": "Les installations de recherche comprennent des laboratoires spécialisés en génie mécanique, systèmes électriques, sécurité des réseaux et tests de matériaux. Spécifications des équipements sur https://www.iset-sfax.tn/recherche/infrastructure.",
                        "en": "Research facilities include specialized laboratories for mechanical engineering, electrical systems, network security, and materials testing. Equipment specifications at https://www.iset-sfax.tn/recherche/infrastructure."
                    }
                }
            ]
        },
        "inscription": {
                "questions": [
                  {
                        "question": {
                          "fr": "Comment postuler pour un transfert vers l'ISET Sfax ?",
                          "en": "How do I apply for a transfer to ISET Sfax?"
                      },
                      "reponse": {
                          "fr": "Les demandes de transfert sont traitées sur https://www.iset-sfax.tn/admissions/transfers. Soumettez les documents requis avant le 15 juin pour être pris en compte pour le semestre d'automne. Contactez transfers@iset-sfax.tn pour toute question.",
                          "en": "Transfer applications are processed through https://www.iset-sfax.tn/admissions/transfers. Submit required documents by June 15th for fall semester consideration. Contact transfers@iset-sfax.tn with questions."
                      }
                  },
                  {
                      "question": {
                          "fr": "Comment demander un retrait de cours ?",
                          "en": "How do I request a course withdrawal?"
                      },
                      "reponse": {
                          "fr": "Les demandes de retrait de cours doivent être soumises via https://www.iset-sfax.tn/registration/course-withdrawal avant la 8e semaine de cours. Incluez votre justification et l'accord de l'enseignant dans le formulaire en ligne.",
                          "en": "Course withdrawal requests must be submitted through https://www.iset-sfax.tn/registration/course-withdrawal before the 8th week of classes. Include your justification and instructor acknowledgment in the online form."
                      }
                  },
                  {
                      "question": {
                          "fr": "Puis-je auditer un cours sans m'y inscrire ?",
                          "en": "Can I audit a course without enrolling?"
                      },
                      "reponse": {
                          "fr": "L'audit de cours nécessite l'approbation de l'enseignant et un frais réduit de 300 TND par cours. Le processus de demande et les restrictions sont détaillés sur https://www.iset-sfax.tn/registration/audit-courses.",
                          "en": "Course auditing requires instructor approval and a reduced fee of 300 TND per course. Application process and restrictions detailed at https://www.iset-sfax.tn/registration/audit-courses."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quel est le processus pour différer un semestre ?",
                          "en": "What's the process for deferring a semester?"
                      },
                      "reponse": {
                          "fr": "Les demandes de différé de semestre doivent être soumises au moins 30 jours avant le début du semestre. Le formulaire de demande et les documents requis sont disponibles sur https://www.iset-sfax.tn/registration/deferral.",
                          "en": "Semester deferral requests must be submitted at least 30 days before semester start. The application form and required documentation are available at https://www.iset-sfax.tn/registration/deferral."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quelles sont les dates limites d'inscription pour le semestre d'automne ?",
                          "en": "What are the registration deadlines for Fall semester?"
                      },
                      "reponse": {
                          "fr": "La date limite d'inscription pour le semestre d'automne est le 15 août. L'inscription tardive (avec frais) est disponible jusqu'au 25 août. Le calendrier complet est sur https://www.iset-sfax.tn/registration/deadlines.",
                          "en": "Fall registration deadline is August 15th. Late registration (with fee) available until August 25th. Complete timetable at https://www.iset-sfax.tn/registration/deadlines."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quelles activités d'orientation sont spécifiques aux étudiants transférés ?",
                          "en": "What orientation activities are specific to transfer students?"
                      },
                      "reponse": {
                          "fr": "L'orientation des étudiants transférés inclut des ateliers d'évaluation des crédits, des introductions aux départements et des conseils spécialisés. Le programme est disponible sur https://www.iset-sfax.tn/registration/transfer-orientation.",
                          "en": "Transfer student orientation includes credit evaluation workshops, departmental introductions, and specialized advising. Schedule at https://www.iset-sfax.tn/registration/transfer-orientation."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quel est le processus pour obtenir des relevés de notes officiels ?",
                          "en": "What is the process for obtaining official transcripts?"
                      },
                      "reponse": {
                          "fr": "Les relevés de notes officiels peuvent être demandés en ligne ou en personne. Les délais de traitement, les frais et les options de livraison sont détaillés sur https://www.iset-sfax.tn/registration/transcripts.",
                          "en": "Official transcripts can be requested online or in person. Processing time, fees, and delivery options detailed at https://www.iset-sfax.tn/registration/transcripts."
                      }
                  },
                   {
                      "question": {
                          "fr": "Des plans de paiement échelonnés sont-ils disponibles pour les frais de scolarité ?",
                          "en": "Are installment plans available for tuition payment?"
                      },
                      "reponse": {
                          "fr": "Les frais de scolarité peuvent être payés en 3 versements (40%-30%-30%) avec des dates limites en septembre, décembre et mars. Configurez votre plan sur https://www.iset-sfax.tn/scolarite/paiement-echelonne.",
                          "en": "Tuition can be paid in 3 installments (40%-30%-30%) with deadlines in September, December, and March. Set up your plan at https://www.iset-sfax.tn/scolarite/paiement-echelonne."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quels documents sont nécessaires pour l'inscription en tant qu'étudiant réinscrit ?",
                          "en": "What documents do I need for registration as a returning student?"
                      },
                      "reponse": {
                          "fr": "Les étudiants réinscrits doivent fournir leur carte d'étudiant, la preuve de la validation du semestre précédent et la régularité de leur statut financier. Liste complète des documents sur https://www.iset-sfax.tn/registration/returning-students.",
                          "en": "Returning students need student ID, proof of previous semester completion, and cleared financial status. Complete checklist at https://www.iset-sfax.tn/registration/returning-students."
                      }
                  },
                  {
                      "question": {
                          "fr": "Y a-t-il une limite au nombre de cours auxquels je peux m'inscrire par semestre ?",
                          "en": "Is there a limit to how many courses I can register for per semester?"
                      },
                      "reponse": {
                          "fr": "Les étudiants peuvent s'inscrire à un maximum de 7 cours (35 ECTS) par semestre. Des exceptions sont possibles avec l'approbation de l'administrateur académique et un GPA minimum de 15/20. Détails sur https://www.iset-sfax.tn/registration/course-load.",
                          "en": "Students may register for a maximum of 7 courses (35 ECTS) per semester. Exceptions require academic advisor approval and min. GPA of 15/20. Details: https://www.iset-sfax.tn/registration/course-load."
                      }
                  },
                  {
                      "question": {
                          "fr": "Puis-je m'inscrire à des cours dans plusieurs campus de l'ISET ?",
                          "en": "Can I register for courses at multiple ISET campuses?"
                      },
                      "reponse": {
                          "fr": "L'inscription inter-campus est possible pour un maximum de 2 cours par semestre avec l'approbation du département. Le processus de demande est détaillé sur https://www.iset-sfax.tn/registration/inter-campus.",
                          "en": "Inter-campus registration is possible for up to 2 courses per semester with departmental approval. The application process is outlined at https://www.iset-sfax.tn/registration/inter-campus."
                      }
                  },
                  {
                      "question": {
                          "fr": "Comment vérifier si je suis éligible pour m'inscrire à des cours avancés ?",
                          "en": "How do I check if I'm eligible to register for advanced courses?"
                      },
                      "reponse": {
                          "fr": "Les vérifications d'éligibilité aux prérequis sont automatisées dans le système d'inscription. Les demandes de vérification manuelle peuvent être soumises sur https://www.iset-sfax.tn/registration/prerequisites.",
                          "en": "Prerequisite eligibility checks are automated in the registration system. Manual verification requests can be submitted at https://www.iset-sfax.tn/registration/prerequisites."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quand l'inscription pour le semestre de printemps commence-t-elle ?",
                          "en": "When does registration open for the spring semester?"
                      },
                      "reponse": {
                          "fr": "L'inscription pour le semestre de printemps ouvre le 15 novembre et se termine le 20 décembre. L'inscription anticipée (pour les étudiants en fin de cursus) commence le 10 novembre. Calendrier sur https://www.iset-sfax.tn/registration/timeline.",
                          "en": "Spring registration opens November 15th and closes December 20th. Early registration (for seniors) starts November 10th. Schedule at https://www.iset-sfax.tn/registration/timeline."
                      }
                  },
                  {
                      "question": {
                          "fr": "Y a-t-il un système de liste d'attente pour les cours complets ?",
                          "en": "Is there a waiting list system for full courses?"
                      },
                      "reponse": {
                          "fr": "Des listes d'attente sont disponibles pour les cours à forte demande. Inscrivez-vous via le portail d'inscription. Politiques et règles de priorité sur https://www.iset-sfax.tn/registration/waiting-lists.",
                          "en": "Waiting lists are available for high-demand courses. Join through the registration portal. Policies and priority rules at https://www.iset-sfax.tn/registration/waiting-lists."
                      }
                  },
                  {
                      "question": {
                          "fr": "Puis-je changer de spécialité après la première année ?",
                          "en": "Can I change my major after the first year?"
                      },
                      "reponse": {
                          "fr": "Le changement de spécialité est possible après la première année avec un GPA minimum de 13/20. Le processus de demande est détaillé sur https://www.iset-sfax.tn/registration/change-major.",
                          "en": "Major changes are possible after completing the first year with minimum GPA of 13/20. The application process is detailed at https://www.iset-sfax.tn/registration/change-major."
                      }
                  },
                  {
                      "question": {
                          "fr": "Quel est le processus pour demander une suspension temporaire ?",
                          "en": "What's the process for requesting a leave of absence?"
                      },
                      "reponse": {
                          "fr": "Les demandes de suspension doivent être soumises au moins 30 jours avant le début du semestre. Formulaire et documents requis sur https://www.iset-sfax.tn/registration/leave-absence.",
                          "en": "Leave of absence requests must be submitted at least 30 days before the semester start. Form and required documentation at https://www.iset-sfax.tn/registration/leave-absence."
                      }
                  },
                  {
                      "question": {
                          "fr": "Dois-je me réinscrire si j'ai été absent pendant un semestre ?",
                          "en": "Do I need to re-register if I've been away for a semester?"
                      },
                      "reponse": {
                          "fr": "Les étudiants revenant après une absence doivent compléter le processus de réinscription. Exigences de documentation et dates limites sur https://www.iset-sfax.tn/registration/re-enrollment.",
                          "en": "Students returning after an absence must complete the re-enrollment process. Documentation requirements and deadlines at https://www.iset-sfax.tn/registration/re-enrollment."
                      }
                  },
                    {
                        "question": {
                            "fr": "Comment m'inscrire pour le prochain semestre ?",
                            "en": "How do I register for the upcoming semester?"
                        },
                        "reponse": {
                            "fr": "Inscrivez-vous en ligne sur https://www.iset-sfax.tn/scolarite avant le 30 août. Pour toute assistance, contactez scolarite@isetsf.rnu.tn ou appelez le +216-74-431-426.",
                            "en": "Register online at https://www.iset-sfax.tn/scolarite before August 30th. For assistance, contact scolarite@isetsf.rnu.tn or call +216-74-431-426."
                        }
                    },
                    {
                        "question": {
                            "fr": "Quelle est la date limite d'inscription aux cours d'été ?",
                            "en": "What's the deadline for summer course registration?"
                        },
                        "reponse": {
                            "fr": "L'inscription aux cours d'été se termine le 15 mai. Inscrivez-vous sur https://www.iset-sfax.tn/scolarite/inscription-cours-ete. Les inscriptions tardives entraînent des frais de 50 TND.",
                            "en": "Summer course registration closes on May 15th. Register at https://www.iset-sfax.tn/scolarite/inscription-cours-ete. Late registrations incur a 50 TND fee."
                        }
                    },
                    {
                        "question": {
                            "fr": "Puis-je m'inscrire aux cours après la date limite officielle ?",
                            "en": "Can I register for courses after the official deadline?"
                        },
                        "reponse": {
                            "fr": "L'inscription tardive est possible jusqu'à 10 jours après la date limite avec des frais de 75 TND. Soumettez votre demande sur https://www.iset-sfax.tn/scolarite/inscription-tardive avec une justification appropriée.",
                            "en": "Late registration is possible up to 10 days after the deadline with a 75 TND late fee. Submit your request at https://www.iset-sfax.tn/scolarite/inscription-tardive with proper justification."
                        }
                    },
                    {
                        "question": {
                            "fr": "Quelle est la structure actuelle des frais de scolarité ?",
                            "en": "What is the current tuition fee structure?"
                        },
                        "reponse": {
                            "fr": "Les frais de scolarité pour les étudiants de premier cycle sont de 1 800 TND par an, tandis que les programmes de master coûtent 2 500 TND par an. Détails sur https://www.iset-sfax.tn/scolarite/frais. Des plans de paiement sont disponibles via finance@isetsf.rnu.tn.",
                            "en": "Undergraduate tuition is 1,800 TND per year, while graduate programs cost 2,500 TND annually. Details at https://www.iset-sfax.tn/scolarite/frais. Payment plans available through finance@isetsf.rnu.tn."
                        }
                    },
                    {
                        "question": {
                            "fr": "Quelle est la note minimale pour réussir à l'ISETSF ?",
                            "en": "What is the minimum passing grade at ISET Sfax?"
                        },
                        "reponse": {
                            "fr": "La note minimale pour réussir est de 10/20 pour chaque cours et de 12/20 pour la moyenne générale. Politiques de notation sur https://www.iset-sfax.tn/scolarite/notation.",
                            "en": "The passing grade is 10/20 for individual courses and 12/20 for the overall program average. Grading policies at https://www.iset-sfax.tn/scolarite/notation."
                        }
                    },
                    {
                        "question": {
                            "fr": "Comment l'ISETSF gère-t-il les cas de plagiat ?",
                            "en": "How does ISET Sfax handle plagiarism cases?"
                        },
                        "reponse": {
                            "fr": "Le plagiat entraîne un zéro automatique pour la première infraction et une possible suspension pour les récidives. Politique complète d'intégrité académique sur https://www.iset-sfax.tn/scolarite/integrite-academique.",
                            "en": "Plagiarism results in an automatic 0 for first offenses and possible suspension for repeat incidents. Full academic integrity policy at https://www.iset-sfax.tn/scolarite/integrite-academique."
                        }
                    },
                    {
                        "question": {
                            "fr": "Quelle est la politique de présence pour les laboratoires ?",
                            "en": "What's the attendance policy for laboratories?"
                        },
                        "reponse": {
                            "fr": "La présence en laboratoire est obligatoire, avec un taux d'absence maximum de 20 %. Toute absence supplémentaire nécessite une attestation médicale. Détails sur https://www.iset-sfax.tn/scolarite/presence.",
                            "en": "Laboratory attendance is mandatory with a maximum 20% absence rate allowed. Missing more requires medical documentation. Details at https://www.iset-sfax.tn/scolarite/presence."
                        }
                    },
                    {
                        "question": {
                            "fr": "Comment m'inscrire pour la remise de diplôme ?",
                            "en": "How do I register for graduation?"
                        },
                        "reponse": {
                            "fr": "Soumettez vos demandes de remise de diplôme sur https://www.iset-sfax.tn/scolarite/diplome trois mois avant la fin. Frais de vérification : 75 TND. Contactez diplome@isetsf.rnu.tn.",
                            "en": "Submit graduation applications at https://www.iset-sfax.tn/scolarite/diplome three months before completion. Verification fee: 75 TND. Contact diplome@isetsf.rnu.tn."
                        }
                    },
                    {
                        "question": {
                            "fr": "Quel est le processus pour se retirer d'un cours ?",
                            "en": "What's the process for course withdrawal?"
                        },
                        "reponse": {
                            "fr": "Les retraits de cours sont autorisés jusqu'à la semaine 6 avec une note 'W'. Après la semaine 6, une note 'F' est enregistrée. Soumettez les demandes sur https://www.iset-sfax.tn/scolarite/retrait-cours.",
                            "en": "Course withdrawals are permitted until week 6 with a 'W' grade. After week 6, an 'F' is recorded. Submit requests at https://www.iset-sfax.tn/scolarite/retrait-cours."
                        }
                    },
                    {
                        "question": {
                            "fr": "Puis-je m'inscrire à des cours d'autres départements ?",
                            "en": "Can I register for courses from other departments?"
                        },
                        "reponse": {
                            "fr": "L'inscription inter-départementale nécessite l'approbation de l'administrateur. Soumettez le formulaire d'inscription inter-départementale sur https://www.iset-sfax.tn/scolarite/inscription-interdepartementale avant la deuxième semaine de cours.",
                            "en": "Interdepartmental registration requires advisor approval. Submit the cross-registration form from https://www.iset-sfax.tn/scolarite/inscription-interdepartementale by the second week of classes."
                        }
                    }
                ]
       },
        "international_students": {
                  "questions": [
                         {
                            "question": {
                                "fr": "Quels services de soutien aux étudiants internationaux offrent-ils ?",
                                "en": "What support services are available for international students?"
                            },
                            "reponse": {
                                "fr": "Un service d'accueil et de soutien est dédié aux étudiants internationaux pour faciliter leur séjour.",
                                "en": "A dedicated reception and support service is available for international students to ease their stay."
                            }
                        },
                        {
                            "question": {
                                "fr": "Quels outils logiciels de simulation sont recommandés par l'ISETSF ?",
                                "en": "What simulation software tools are recommended by ISET Sfax?"
                            },
                            "reponse": {
                                "fr": "L'institution recommande divers outils de simulation disponibles en licences académiques pour les étudiants.",
                                "en": "The institution recommends various simulation tools available with academic licenses for students."
                            }
                        },
                        {
                            "question": {
                                "fr": "Comment l'ISETSF développe-t-il ses collaborations internationales en formation ?",
                                "en": "How does ISET Sfax develop its international training collaborations?"
                            },
                            "reponse": {
                                "fr": "Des conventions et accords de coopération sont signés avec des établissements étrangers pour favoriser les échanges.",
                                "en": "Agreements and cooperation conventions are signed with foreign institutions to promote exchanges."
                            }
                        },
                        {
                            "question": {
                                "fr": "Quels programmes d'échange pour étudiants sont offerts ?",
                                "en": "What exchange programs for students are offered?"
                            },
                            "reponse": {
                                "fr": "Des programmes d'échange semestriels et annuels permettent aux étudiants d'acquérir une expérience internationale.",
                                "en": "Semester and annual exchange programs allow students to gain international experience."
                            }
                        },
                        {
                            "question": {
                                "fr": "Comment candidater pour un échange universitaire ?",
                                "en": "How do I apply for a university exchange?"
                            },
                            "reponse": {
                                "fr": "Les conditions et formulaires de candidature sont disponibles dans la section internationale du site.",
                                "en": "The application conditions and forms are available in the international section of the website."
                            }
                        },
                        {
                            "question": {
                                "fr": "Quels avantages d'un séjour à l'étranger sont mis en avant ?",
                                "en": "What are the highlighted benefits of studying abroad?"
                            },
                            "reponse": {
                                "fr": "L'expérience internationale offre une ouverture culturelle et un renforcement des compétences linguistiques.",
                                "en": "International experience offers cultural exposure and strengthens language skills."
                            }
                        },
                        {
                            "question": {
                                "fr": "Comment se préparer à une mobilité internationale ?",
                                "en": "How should I prepare for international mobility?"
                            },
                            "reponse": {
                                "fr": "Des conseils pratiques sur la préparation d'un séjour à l'étranger sont disponibles sur le site.",
                                "en": "Practical tips for preparing for a stay abroad are available on the website."
                            }
                        },
                        {
                            "question": {
                                "fr": "Où trouver les témoignages d'étudiants revenus d'échanges internationaux ?",
                                "en": "Where can I find testimonials from students who have returned from international exchanges?"
                            },
                            "reponse": {
                                "fr": "Les retours d'expérience sont publiés dans la rubrique témoignages de la section internationale.",
                                "en": "Testimonials are published in the testimonials section of the international section."
                            }
                        },
                        {
                            "question": {
                                "fr": "Quels partenariats avec des universités européennes existent ?",
                                "en": "What partnerships with European universities exist?"
                            },
                            "reponse": {
                                "fr": "L'ISETSF a signé plusieurs accords avec des universités en Europe pour faciliter les échanges académiques.",
                                "en": "ISET Sfax has signed several agreements with universities in Europe to facilitate academic exchanges."
                            }
                        },
                        {
                            "question": {
                                "fr": "Comment l'ISETSF soutient-il la mobilité des chercheurs ?",
                                "en": "How does ISET Sfax support researcher mobility?"
                            },
                            "reponse": {
                                "fr": "Des programmes spécifiques permettent aux chercheurs de participer à des projets internationaux.",
                                "en": "Specific programs allow researchers to participate in international projects."
                            }
                        },
                     {
                          "question": {
                              "fr": "Quels services de soutien aux étudiants internationaux offrent-ils ?",
                              "en": "What support services are available for international students?"
                          },
                          "reponse": {
                              "fr": "Un service d'accueil et de soutien est dédié aux étudiants internationaux pour faciliter leur séjour.",
                              "en": "A dedicated reception and support service is available for international students to ease their stay."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels outils logiciels de simulation sont recommandés par l'ISETSF ?",
                              "en": "What simulation software tools are recommended by ISET Sfax?"
                          },
                          "reponse": {
                              "fr": "L'institution recommande divers outils de simulation disponibles en licences académiques pour les étudiants.",
                              "en": "The institution recommends various simulation tools available with academic licenses for students."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment l'ISETSF développe-t-il ses collaborations internationales en formation ?",
                              "en": "How does ISET Sfax develop its international training collaborations?"
                          },
                          "reponse": {
                              "fr": "Des conventions et accords de coopération sont signés avec des établissements étrangers pour favoriser les échanges.",
                              "en": "Agreements and cooperation conventions are signed with foreign institutions to promote exchanges."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels programmes d'échange pour étudiants sont offerts ?",
                              "en": "What exchange programs for students are offered?"
                          },
                          "reponse": {
                              "fr": "Des programmes d'échange semestriels et annuels permettent aux étudiants d'acquérir une expérience internationale.",
                              "en": "Semester and annual exchange programs allow students to gain international experience."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment candidater pour un échange universitaire ?",
                              "en": "How do I apply for a university exchange?"
                          },
                          "reponse": {
                              "fr": "Les conditions et formulaires de candidature sont disponibles dans la section internationale du site.",
                              "en": "The application conditions and forms are available in the international section of the website."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels avantages d'un séjour à l'étranger sont mis en avant ?",
                              "en": "What are the highlighted benefits of studying abroad?"
                          },
                          "reponse": {
                              "fr": "L'expérience internationale offre une ouverture culturelle et un renforcement des compétences linguistiques.",
                              "en": "International experience offers cultural exposure and strengthens language skills."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment se préparer à une mobilité internationale ?",
                              "en": "How should I prepare for international mobility?"
                          },
                          "reponse": {
                              "fr": "Des conseils pratiques sur la préparation d'un séjour à l'étranger sont disponibles sur le site.",
                              "en": "Practical tips for preparing for a stay abroad are available on the website."
                          }
                      },
                      {
                          "question": {
                              "fr": "Où trouver les témoignages d'étudiants revenus d'échanges internationaux ?",
                              "en": "Where can I find testimonials from students who have returned from international exchanges?"
                          },
                          "reponse": {
                              "fr": "Les retours d'expérience sont publiés dans la rubrique témoignages de la section internationale.",
                              "en": "Testimonials are published in the testimonials section of the international section."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels partenariats avec des universités européennes existent ?",
                              "en": "What partnerships with European universities exist?"
                          },
                          "reponse": {
                              "fr": "L'ISETSF a signé plusieurs accords avec des universités en Europe pour faciliter les échanges académiques.",
                              "en": "ISET Sfax has signed several agreements with universities in Europe to facilitate academic exchanges."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment l'ISETSF soutient-il la mobilité des chercheurs ?",
                              "en": "How does ISET Sfax support researcher mobility?"
                          },
                          "reponse": {
                              "fr": "Des programmes spécifiques permettent aux chercheurs de participer à des projets internationaux.",
                              "en": "Specific programs allow researchers to participate in international projects."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels programmes d'échange pour chercheurs sont proposés ?",
                              "en": "What exchange programs for researchers are offered?"
                          },
                          "reponse": {
                              "fr": "Des programmes d'échange académique existent pour favoriser la coopération internationale.",
                              "en": "Academic exchange programs exist to promote international cooperation."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels partenariats internationaux l'ISETSF entretient-il ?",
                              "en": "What international partnerships does ISET Sfax have?"
                          },
                          "reponse": {
                              "fr": "L'ISETSF a signé des accords de coopération avec des universités et centres de recherche à l'étranger.",
                              "en": "ISET Sfax has signed cooperation agreements with universities and research centers abroad."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment candidater à un programme d'échange international ?",
                              "en": "How do I apply for an international exchange program?"
                          },
                          "reponse": {
                              "fr": "Les étudiants peuvent trouver les conditions et formulaires d'inscription dans la section internationale.",
                              "en": "Students can find the application conditions and forms in the international section."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels sont les avantages d'une formation internationale ?",
                              "en": "What are the benefits of international education?"
                          },
                          "reponse": {
                              "fr": "Une formation internationale offre des perspectives globales et un accès à un réseau professionnel élargi.",
                              "en": "International education provides global perspectives and access to a broader professional network."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment l'ISETSF accueille-t-il les étudiants étrangers ?",
                              "en": "How does ISET Sfax welcome international students?"
                          },
                          "reponse": {
                              "fr": "L'institution met en place un dispositif d'accompagnement pour faciliter l'intégration des étudiants étrangers.",
                              "en": "The institution provides support to help integrate international students."
                          }
                      },
                      {
                          "question": {
                              "fr": "Où trouver des informations sur les visas étudiants ?",
                              "en": "Where can I find information about student visas?"
                          },
                          "reponse": {
                              "fr": "Des conseils et démarches pour l'obtention de visas sont disponibles dans la section internationale.",
                              "en": "Advice and procedures for obtaining student visas are available in the international section."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels cours en langues étrangères sont proposés ?",
                              "en": "What foreign language courses are offered?"
                          },
                          "reponse": {
                              "fr": "L'ISETSF propose des cours d'anglais et d'autres langues pour préparer les étudiants aux contextes internationaux.",
                              "en": "ISET Sfax offers English and other language courses to prepare students for international contexts."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment participer à des conférences internationales ?",
                              "en": "How can I participate in international conferences?"
                          },
                          "reponse": {
                              "fr": "Les informations sur les conférences et séminaires internationaux sont affichées sur le site.",
                              "en": "Information on international conferences and seminars is posted on the website."
                          }
                      },
                      {
                          "question": {
                              "fr": "Quels accords de double diplôme existent ?",
                              "en": "What double degree agreements exist?"
                          },
                          "reponse": {
                              "fr": "Des accords de double diplôme avec des institutions partenaires sont mis en avant sur le site.",
                              "en": "Double degree agreements with partner institutions are highlighted on the website."
                          }
                      },
                      {
                          "question": {
                              "fr": "Comment obtenir une bourse pour étudier à l'étranger ?",
                              "en": "How can I get a scholarship to study abroad?"
                          },
                          "reponse": {
                              "fr": "Des informations sur les bourses internationales et critères d'éligibilité sont disponibles dans la section dédiée.",
                              "en": "Information on international scholarships and eligibility criteria is available in the dedicated section."
                          }
                      }
                  ]
        },
        "system_errors": {
          "titre": {
              "fr": "Erreurs du Système",
              "en": "System Errors"
          },
          "questions": [
              {
                  "question": {
                      "fr": "Je ne suis pas sûr de comprendre cette question.",
                      "en": "ERROR_NO_MATCH"
                  },
                  "reponse": {
                      "fr": "Je ne suis pas sûr de comprendre cette question. Pourriez-vous la reformuler ou demander quelque chose sur les programmes, les admissions, les installations du campus ou les services aux étudiants de l'ISET Sfax ?",
                      "en": "I'm not sure I understand that question. Could you rephrase it or ask something about ISET Sfax's programs, admissions, campus facilities, or student services?"
                  }
              },
              {
                  "question": {
                      "fr": "J'ai trouvé plusieurs réponses possibles à votre question.",
                      "en": "ERROR_MULTIPLE_MATCHES"
                  },
                  "reponse": {
                      "fr": "J'ai trouvé plusieurs réponses possibles à votre question. Pourriez-vous être plus précis sur ce que vous aimeriez savoir ?",
                      "en": "I found several possible answers to your question. Could you be more specific about what you'd like to know?"
                  }
              },
              {
                  "question": {
                      "fr": "Je m'excuse pour le délai.",
                      "en": "ERROR_TIMEOUT"
                  },
                  "reponse": {
                      "fr": "Je m'excuse pour le délai. Essayons à nouveau avec votre question sur l'ISET Sfax.",
                      "en": "I apologize for the delay. Let's try again with your question about ISET Sfax."
                  }
              }
          ]
      }
    }
  }
